{"title":"Lexicon","googleAnalytics":"UA-37033501-9","index":{"title":"Home","description":"Lexicon is a set of principles, patterns and tools created to provide a common design framework for crafting user interfaces within Liferay product ecosystem.","content":" Lexicon Design What is Lexicon Foundations Pattern Library News and Updates Resources Copyright © 2018 Liferay, Inc. Except as otherwise noted, the content of this site is licensed under CC BY-SA 4.0 license. new WOW().init(); ","srcFilePath":"src/pages/index.soy","id":"pages","location":"/./","url":"/./","children":{"docs":{"title":"Docs","url":"/docs/patterns/alerts.html","content":" ","srcFilePath":"src/pages/docs/index.soy","id":"docs","location":"/docs/","customURL":true,"children":{"search":{"title":"Search","description":"Documentation search results.","hidden":true,"content":" Electric Docs Start learning how to leverage the power of Electric. ","srcFilePath":"src/pages/docs/search.soy","id":"search","location":"/docs/search.html","url":"/docs/search.html"},"designPrinciples":{"children":{"accessibility":{"title":"Accessibility","description":"Building an accessible design system","layout":"guide","weight":1,"hidden":"yes","content":" What is accessibility? Accessibility guarranties the interaction of people with disabilities with your site or product. Why you should provide accessible interfaces? Accessibility is one of the main concerns in Liferay, therefore, the design team invests effort on achieving a design system everyone can use. Accessibility brings independance to people with disabilities. It offers the same range of possibilities to users with different physical problems breaking bareers in terms of interaction. Remember that all your users are equally important. Accessibility can be also a legal requierement for your business. Some countries have strict regulations on accessibility and force you to follow standards. These standards and level of accessibility inside them can vary depending on the country. Some of these standards are: Web Content Accessibility Guidelines (WCAG) from W3C Section 508 of the U.S. Rehabilitation Act ","srcFilePath":"src/pages/docs/designPrinciples/accessibility.md","id":"accessibility","location":"/docs/designPrinciples/accessibility.html","url":"/docs/designPrinciples/accessibility.html"},"animations":{"title":"Animations","titleLabel":"Clay","titleLabelLink":"https://clayui.com/","description":"Animations are used to transmit messages while capturing the user attention in a different way.","layout":"guide","weight":1,"content":" {$page.description} Usage Lexicon provides different types of animation for certain purposes. We use these animations as a message support but we never use them alone without any clarification. Specific examples can be found in dataset display. Empty collection The satellite express that the dataset is empty not being anything the collection. Use this animation when your initial dataset is empty or a folder is empty. Empty search The telescope represents the idea of looking for something in the space a nothing has been found. Use this animation for empty search results or empty results on while applying filters over a data set. Successful empty state The spaceship taking off represents a successful state. Use this animation when a list has been emptied that is worthy of celebration. For example, when a notifications list gets emptied. Changing animations Changing animations is possible. This is just the set of animations that Lexicon provides for Liferay products. Your business may have its own needs and this is one of the points where your brand can have an impact by customizing the animations. Our advice is to choose a theme and create a story behind it. In our case, we have bet for a space theme, an we have created several animated scenes to support our messages. ","srcFilePath":"src/pages/docs/designPrinciples/animations.md","id":"animations","location":"/docs/designPrinciples/animations.html","url":"/docs/designPrinciples/animations.html"},"colors":{"title":"Color","description":"A consistent color palette is an essential asset in the communication resources of any design system.","layout":"guide","weight":1,"content":" {$page.description} Colors have a huge impact in a system as they define the visual identity, they bring harmony, they communicate, among other characteristics. Lexicon defines the following color palette that you are free to change for your own. Primary colors Primary colors define part of the visual identity of Lexicon as a system. These colors have been carefully thought to be easily combined and be sure that accessibility is well covered. | Color | Code | Usage | | ----- | ---- | ----- | | Main | 272833 | Texts/icons, navigation background, borders and dividers. | | Primary | #0B5FFF | Main actions like primary buttons, links, hover and active. | | White | #FFFFFF | Cards background, toolbar background, modals, forms and texts/icons. | | Light | #F1F2F5 | Main background of the application, input’s backgrounds and active state in the secondary botton. | Main color variations | Color | Code | Usage | | ----- | ---- | ----- | | Main | 272833 | First level navigation background and primary texts. | | Main Lighten 4% | #30313F | Second level navigation background. | | Main Lighten 8% | #393A4A | Third level navigation background and active state on navigation. | | Main Lighten 28% desat 5% | #6B6C7E | Secondary texts. | | Main Lighten 52% | #A7A9BC | Disabled texts. | | Main Lighten 65% | #CDCED9 | Border for clickable elements like buttons. | | Main Lighten 74% | #E7E7ED | Disabled Background and Border for dividers. | | Secondary Hover | #F7F8F9 | Hover State for the Secondary button. | Primary blue color variations | Color | Code | Usage | | ----- | ---- | ----- | | Primary Darken 10%| 004AD7 | Active button and links color. | | Primary Darken 5% | #0053f0 | Hover button and links color. | | Primary | #0B5FFF | Main action and links. | | Primary Lighten 23% | #80ACFF | Links on the navigation section. | | Primary Lighten 33% | #B3CDFF | Disabled background. | | Primary Lighten 45% | #F0F5FF | Hover and active background in tables and lists. | Secondary colors Secondary colors are frequently used colors, also important as primary but do not define the visual identity in a stronger way as Primary colors do. A closer definition of each color, its variations and usage: | Color | Code | Usage | | ----- | ---- | ----- | | Error | DA1414 | Text color in error messages. | | Error Lighten 28% | #F48989 | Border color in error status messages. | | Error Lighten 50% | #FEEFEF | Background color in error status messages. | | Color | Code | Usage | | ----- | ---- | ----- | | Success | #287D3C | Text color in success messages. | | Success Lighten 35% | #5ACA75 | Border color in success status messages. | | Success Lighten 63% | #EDE79F0 | Background color in success messages like alerts. | | Color | Code | Usage | | ----- | ---- | ----- | | Warning | #B95000 | Text color in warning messages. | | Warning Lighten 25% | #FF8F39 | Border color in warning messages like alerts. | | Warning Lighten 60% | #FFF4EC | Background color in warning messages like alerts. | | Color | Code | Usage | | ----- | ---- | ----- | | Info | #2E5AAC | Text color in error messages. | | Info Lighten 28% | #89A7E0 | Border color in info status messages. | | Info Lighten 53% | #EEF2FA | Background color in info status messages. | Last color definition row is used in input fields to reduce the impact of the color saturation in the borders. Changing Lexicon color palette Changing the pre-established color palette is always possible. From Lexicon we understand that our color palette might not fit your needs or requirements as you can have a different corporate image. You just need to set you colors instead of our colors. ","srcFilePath":"src/pages/docs/designPrinciples/colors.md","id":"colors","location":"/docs/designPrinciples/colors.html","url":"/docs/designPrinciples/colors.html"},"grid":{"title":"Grid","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/layout/grid.html","description":"The main structural pattern that underlies the construction and positioning of all system components.","layout":"guide","weight":1,"content":" {$page.description} The aim of the Lexicon layout framework is to provide a common structural reference that contributes to streamlining the component construction and page composition processes as well as favoring visual consistency between the different elements of the interface. Base Grid The Base Grid is the main metric reference of our system from which the rest of the layout structures are built. It is at the same time the starting point when defining the dimensions, paddings and margins of the elements of the interface. This grid is constructed from a base 8px module, so that both the dimensions of the elements and the distances between them will always be multiples of 8; 16, 24, 32, 40, 48 … In this way we provide a common metric pattern that contributes to create visual coherence and consistency between the different elements of the system and their spatial relationships. The use of this reference grid favors an efficient workflow, reducing the number of design decisions as well as improving communication between designers and developers. Establishing a minimum metric unit that is not too small can help us limit the chances of distorting the visual consistency and taking advantage of its other benefits. However there will always be specific situations in which it is convenient to work with values ​​smaller than 8px. In these cases, the system also provides a downward scaling allowing the use of the 4px unit. Either way, values ​​less than 8 px will be primarily associated with the anatomy of the interface's basic elements rather than the specification of distances between elements and page composition. Making use of the terminology proposed by atomic design, these minimum measures would be used almost exclusively to define the internal anatomy of elements like atoms or molecules. Taking care at all times that the block that forms the element fits the base grid of 8 px. As for example the molecule formed by a label and a text input, or the one formed by a label, an input an a helper text. To know a little more about the grid of 8 px we recommend checking some of the articles that have served as reference and inspiration for us to adopt this pattern. 8pt Grid Intro to The 8-Point Grid System Column System The column system is the main structural pattern when organizing and arranging elements on page horizontally. It is not so much a reference to establish the distances between small elements like the different icons or buttons that can coexist in a toolbar for example. It is more a layout framework oriented to organize and establish divisions between medium and large blocks of content. The Lexicon system is a 12 column structure based on the Bootstrap CSS Grid, where we introduce a change in the value of the gutter to fit our base grid. In this case the gutter would be 24px. A value that we find repeated in other basic structural references of the system. The columns behave in a fluid manner, so that their width will always be a relative value that varies depending on the size of their parent container. The gutter is the only value that remains fixed when the viewport resizes. Vertical Rhythm The grid base of 8 px is also established as baseline in order to set the distances between elements at vertical level. But when defining the vertical spacing between paragraphs of text and elements or groups of elements that somehow configure medium and large size structural blocks is better to have a greater value as a reference. Taking the name from bootstrap variables, we call it “spacer-y”. To set this value, we will refer to the line height of the main system font style; 24px. With this reference we seek to establish a pattern that helps to avoid the dance of measures and favors the consistency in the vertical rhythm. For small viewports, we can make adjustments with the aim of optimizing vertical space but always respecting the base grid. Normally in these cases we use the 16px spacer-y as we do for the gutter between columns and the lateral space of the container. It is understood that this metric pattern does not solve the vertical space needs of all possible cases. Either way it is established as a starting point on which to make timely adjustments when necessary. Containers Lexicon provides two types. A fixed width container and a fluid container with relative width. Fluid container The width of this container is adjusted fluidly according to the size of the viewport. Fixed width container This container is defined by a value of maximum width. This value is adjusted to the sizes of the different viewports according to predefined breakpoints. Breakpoint table In this table you can visualize all the variations of the layout system values according to the different breakpoints. | Breakpoint | Device Size | Container Width | | ---------- | ----------- | ------------------- | | < 576px | Extra small devices (Portrait phones) | Auto | | &ge; 576px | Small devices (Landscape phones) | Auto | | &ge; 768px | Medium devices (Tablets) | Auto | | &ge; 992px | Large devices (Desktops) | Auto | | &ge; 1280px | Extra large devices (Large desktops) | 1248px | ","srcFilePath":"src/pages/docs/designPrinciples/grid.md","id":"grid","location":"/docs/designPrinciples/grid.html","url":"/docs/designPrinciples/grid.html"},"typography":{"title":"Typography","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/layout/typography.html","description":"A basic reference for the definition of the visual identity and the organization of the content.","layout":"guide","weight":1,"content":" {$page.description} Font Stacks Lexicon uses two text styles exclusively. A sans serif one which is the main style of the typographic system, and a monospaced one used to render code. Due to the customizable, multi-language and multi-platform nature of Liferay products like Portal, Lexicon and its implementation have opted for an agnostic use of typography. According to this, it has been decided not to include any type family as part of the framework and to resort in any case to the family provided by the operating system on which Liferay is being accessed. This way we avoid web-font delivery services or font files stored on the server. With this in mind, Lexicon and Clay embrace the standard known as \"Native Font Stack\" as the basis for its typographic source. In this tables we list the different typographic families associated with the main operating systems included in each font stack. Sans Serif For sans serif style, we take the Bootstrap native font stack as a reference in which we have also included families for Ubuntu, Oxigen and Gnome operating systems | OS | Font Family | | -- | ----------- | | Windows | Segoe UI | | MacOS & iOS | San Francisco | | Chrome OS & Android | Roboto | | Ubuntu | Ubuntu | | OxygenOS | Oxygen | | Cantarell | Gnome | | Basic web fallbacks | Arial, Helvetica Neue, sans-serif | | Emoji Fonts | Apple Color Emoji, Segoe UI Emoji, Segoe UI Symbol | system-ui,-apple-system,BlinkMacSystemFont,\"Segoe UI\",Roboto,Oxygen-Sans,Ubuntu,Cantarell,\"Helvetica Neue\",Arial,sans-serif,\"Apple Color Emoji\",\"Segoe UI Emoji\",\"Segoe UI Symbol\"; Monospaced For monospaced style, we take as a reference also the font stack provided by Bootstrap. | OS | Font Family | | -- | ----------- | | Windows | Segoe UI | | MacOS & iOS | San Francisco | | Chrome OS & Android | Roboto | | Basic web fallback | Courier New, monospaced | SFMono-Regular,Menlo,Monaco,Consolas,\"Liberation Mono\",\"Courier New\",monospace; Being Mac OS the most widely used operating system for design tasks within Liferay and one of the most used in general, it has been decided to use the San Francisco font family for the visual examples of the system both in the technical documentation and in Lexicon Site. Type Scale In the same line of looking for the simplification and standardization of the elements that make up the foundations of the system, the lexicon scale is based on the values initially provided by Bootstrap and follows one of the most used type scales in web products nowadays. A scale based on an initial increase of 2px that grows to 4px in larger font sizes to favor contrast and hierarchical identification. A non-linear arithmetic progression that does not exactly fit any of the classic ratios, but provides an understandable and easy to remember set which is quite helpful dealing with complex products. px rem example 10px 0.625rem Design matters 12px 0.75rem Design matters 14px 0.875rem Design matters 16px 1rem Design matters 18px 1.125rem Design matters 20px 1.25rem Design matters 24px 1.5rem Design matters 28px 1.75rem Design matters 32px 2rem Design matters 36px 2.25rem Design matters 40px 2.rem Design matters Basic Formatting Line Height Lexicon typographic system uses two reference line heights. A standard line height with a 1:1.5 ratio, and another one with a 1:1.25 ratio used for headings. 1:1.5 is also one of the most common line height ratios used in web development right now. A formula that applied to the body font of 16px (1rem) returns a value of 24px (1.5rem) which is the main reference measure for the vertical organization of content in Lexicon. Also, regarding accessibility concerns, using a minimum value of 1.5 for line-height for main paragraph content, can help people with low vision conditions, as well as people with cognitive concerns such as Dyslexia. In large font sizes, the optical perception we have of the spaces between lines is different. The white space between lines acquire more light and more prominence. Therefore, it is considered good legibility practice to reduce the line height in font sizes starting from 20px and above. The same applies to uppercase texts. The white spaces between text lines in uppercase are shown as more defined white blocks than those created by lowercase letters which have ascending and descending strokes. That's why uppercase headings in Lexicon, despite being 12px and 14px are also applied a ratio of 1: 1.25 | Line Height | ratio | | -- | ----------- | | Standard | 1:1.5 | | Secondary | 1:1.25 | Lexicon only provides the value of line height for texts susceptible to going to more than one line such as paragraphs, headlines and list group items for example. For the rest of ui elements that incorporate text within their structure as buttons, input fields of single line, stickers, badges or labels for example, this value will be defined by the implementation. Font Weight Lexicon incorporates three font weights in order to provide enough options to solve the different needs of content hierarchy without adding complexity to the system. Font Height Reference Regular 400 Semibold 600 Bold 700 The specific use cases of the different weights are defined in the \"Type Styles\" section. Letter Case The system uses lowercase as a basis regardless of the specific capitalization rules. It only uses the uppercase as a hierarchy resource in the section divider pattern that we can find in dataset display views and forms for example. The specific cases of use of the different weights are defined in the \"Type Styles\" section. Line Length In order to provide a comfortable continuous reading we recommend to adjust the texts of medium and long length to a line width within a range between 60 and 100 characters including spacing. In this way we favor an adequate reading rhythm avoiding too long lines that can force the look excessively and lose the horizontal reference, or too short lines that interrupt the reading very often and force a constant eye movement. Type styles These tables show the different format combinations that can be found in Lexicon with some reference examples. Headings | Font Size | Line Height | Font Weight | Letter Case | Use Example | | --------- | ----------- | ----------- | ----------- | ----------- | | 12px / 0.75rem | 1.25 | 600 (semibold) | Uppercase | Dataset section divider | | 14px / 0.875rem | 1.25 | 600 (semibold) | Uppercase | Form section divider | | 16px / 1rem | 1.25 | 700 (bold) | Lowercase | Application and Page titles | | 20px / 1.25rem | 1.25 | 700 (bold) | Lowercase | Form title | | 24px / 1.5rem | 1.25 | 700 (bold) | Lowercase | Asset title in asset display widgets | | 28px / 1.75rem | 1.25 | 700 (bold) | Lowercase | Blog Entry title in blogs widget | | 36px / 2.25rem | 1.25 | 700 (bold) | Lowercase | Blog Entry Detail title | Paragraph | Font Size | Line Height | Font Weight | Letter Case | Use Example | | --------- | ----------- | ----------- | ----------- | ----------- | | 16px / 1rem | 1.5 | 400 (regular) | Lowercase | Mid-long read text | The paragraph element incorporates a margin bottom of 0.75rem (12px) to define the separation between the different text blocks. General UI Elements All the Lexicon UI elements are styled based on a combination of these format values previously described. You can check the font attributes of each element in its specific page. ","srcFilePath":"src/pages/docs/designPrinciples/typography.md","id":"typography","location":"/docs/designPrinciples/typography.html","url":"/docs/designPrinciples/typography.html"},"writingstyle":{"title":"Writing Style","description":"Clarity, confidence, and consistency in messaging promotes product reliability.","layout":"guide","weight":1,"content":" {$page.description} Words give meaning to your meticulously designed product. Without the proper messaging for your product’s navigation and functionality, uncertainty creeps into your user’s minds. The messages and naming conventions you use throughout your product complement its design. No matter how well-constructed your design, poor messaging can doom your product’s effectiveness. Clarity, confidence, and consistency in messaging promotes product reliability. Be Clear Longer messaging is not always more helpful. Be concise; understand your user’s needs in a given situation and provide them with just enough information to be successful. If an interaction is obvious, don’t add messaging. A wordy product is an eyesore. Example Initiates the process. If you click this button, then you will initiate a process that does something. Doing something is essential for something else. Be Confident Be bold! Take confidence in what you say! The way you provide information sets the tone for what users expect. Products that exude confidence put users at ease when making difficult decisions. Example Click this to save your work. Clicking this should save your work. Be Current Use present tense throughout product messaging. Promote the product as being alive; it helps you now, telling you what to do now. If you click a button, it won’t do something later; it accomplishes the task immediately. Example Saves the form. This will save the form. Be Consistent Consistency gives users peace of mind. You want people to feel comfortable navigating your product. Surprises and uncertainty make people uncomfortable. Consistent messaging gives users freedom to focus on what they’re doing, and not worry about what the product is trying to tell them. Below are two example techniques you can apply for consistent phrasing: 1. Apply Text Styles Consistently Formulate the styling you want to use in your product and stick to it. For example, you could assign styling standards to messaging types in your product (e.g., headings, instructions, checkboxes, etc.). Title: Capitalize all words (except articles, prepositions, and coordinating conjunctions) and omit any trailing punctuation. Phrase: Capitalize only the first word and all proper nouns and omit any trailing periods (question marks allowed). Sentence: Capitalize only the first word and all proper nouns and use normal punctuation. Tone, capitalization, and punctuation should follow a similar style on any given interface. Example 2. Address Your Users the Same Way For example, don’t refer to them as we, the user, and you in the same context. Example Click the button to continue. You can select the other button at any time. Click the button so we can continue. The user can select the other button at any time. Remember, your writing style sets the tone for your product. Show people you care by guiding them with sensible, consistent messaging. ","srcFilePath":"src/pages/docs/designPrinciples/writingstyle.md","id":"writingstyle","location":"/docs/designPrinciples/writingstyle.html","url":"/docs/designPrinciples/writingstyle.html"},"layout":{"title":"Layout","description":"Layout section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/designPrinciples/layout/index.md","id":"layout","location":"/docs/designPrinciples/layout/","url":"/docs/designPrinciples/layout/","children":{"layoutCards":{"title":"Cards Layout","description":"The card layout represents the main structural pattern for displaying cards in a dataset.","layout":"guide","weight":2,"content":" {$page.description} The card layout adapts 100% to the width of the container adjusting the size of the cards and the number of cards per row to the different viewport sizes. This is a layout that we can find in templates like Dataset Display. Responsive behavior Attributes Example ","srcFilePath":"src/pages/docs/designPrinciples/layout/layoutCards.md","id":"layoutCards","location":"/docs/designPrinciples/layout/layoutCards.html","url":"/docs/designPrinciples/layout/layoutCards.html"},"layoutForm":{"title":"Form Box","description":"The basic layout used to contain form structures built based on 8/12 grid columns.","layout":"guide","weight":2,"content":" {$page.description} The Form Box is the most basic layout used to contain form structures. This layout is composed of a box that occupies 8 columns of the grid with 2 offset columns on both sides. Responsive behavior The main point to take into account in its adaptation to the different viewport sizes is the change from 8 to 12 columns on viewport sizes equal or less than 768px in order to optimize space for content. Attributes Example ","srcFilePath":"src/pages/docs/designPrinciples/layout/layoutForm.md","id":"layoutForm","location":"/docs/designPrinciples/layout/layoutForm.html","url":"/docs/designPrinciples/layout/layoutForm.html"},"layoutFull":{"title":"Full Box","description":"The Full Box layout adapts 100% to the width of the container occupying 12 columns of the grid.","layout":"guide","weight":1,"content":" {$page.description} This is a layout that we can find in templates like Dataset Display. Responsive behavior The box is fluid and still occupies 100% of the container across the different breakpoints. The main aspect to take into account in the responsive behavior of this layout is the disappearance of the lateral spaces in sizes smaller than 576 px. Attributes Example Cards The card layout adapts 100% to the width of the container adjusting the size of the cards and the number of cards per row to the different viewport sizes. This is a layout that we can find in templates like Dataset Display. Responsive behavior Attributes Example ","srcFilePath":"src/pages/docs/designPrinciples/layout/layoutFull.md","id":"layoutFull","location":"/docs/designPrinciples/layout/layoutFull.html","url":"/docs/designPrinciples/layout/layoutFull.html"},"layoutSidebar":{"title":"Sidebar + Box","description":"An specific layout used when we need a left sidebar to include a vertical navigation.","layout":"guide","weight":3,"content":" {$page.description} The space is organized in 3 columns for the sidebar and 9 or 8 columns for the content depending on its type. This way we would have two different configurations: 3+9 columns This is the default configuration used when the content is a table, a list or any other content structure except a form. Responsive behavior On viewport sizes equal or less than 768px we introduce to changes of the layout in order to optimize space for content: The change of the vertical navigation to a toggle top navigation as is described on the Nested navigation. The change of the box from 9 to 12 columns. Attributes Example 3+8 columns (Forms) When the box shown in this type of layout is a box that contains a form, it has to be adapted to the measures established for form containers. Therefore the space to occupy would be 8 instead of 9 columns. Responsive behavior The main point to take into account is the change from 8 to 9 columns on viewport sizes equal or less than 992px in order to optimize space for content. Attributes Example Exceptions 3+9 columns and 3+8 columns are the most common situations to have in Lexicon interfaces, but 2 other exceptional scenarios are possible. Scenario 1: 3+9 columns configuration turns into 2+10 columns configuration. Scenario 2: 3+8 columns configuration turns into 2+9 columns configuration. These two scenarios are only desirable when you are sure that the sidebar width is enough with 2 columns. Reasons to move into these configurations can be: Really short vertical navigation titles. Please make sure this happens in all the languages that your site manages. More space in the main box to fit a table with many columns. Please if you move into these configuration make sure you apply 2 columns for the sidebar in all application sections instead of 2 in some and 3 in others for the sake of consistency in your application.","srcFilePath":"src/pages/docs/designPrinciples/layout/layoutSidebar.md","id":"layoutSidebar","location":"/docs/designPrinciples/layout/layoutSidebar.html","url":"/docs/designPrinciples/layout/layoutSidebar.html"}},"childIds":["layoutFull","layoutCards","layoutForm","layoutSidebar"]}},"title":"Foundations","description":"Keep updated.","layout":"guide","icon":"lexicon-site-principles","weight":2,"content":"","srcFilePath":"src/pages/docs/designPrinciples/index.md","id":"designPrinciples","location":"/docs/designPrinciples/","url":"/docs/designPrinciples/","childIds":["accessibility","animations","colors","grid","layout","typography","writingstyle"]},"lexicon":{"title":"Get Started","description":"User experience design language.","layout":"guide","icon":"lexicon-site-about","weight":1,"content":" Design language Lexicon is a design language created with the aim of providing a common framework for building interfaces within the Liferay product ecosystem. A guide to foundations, components, patterns and contexts of use that contributes to give consistency and coherence to these products and, ultimately, provide a satisfactory and unified experience to its users. Lexicon is a constantly evolving project. An iterative work that seeks to improve and gradually adapt to the evolution of technology and people. Modular approach The Lexicon approach to interface design is based essentially on modularity. It is configured as a system that from a controlled number of components is able to respond to the multiple and different needs of liferay products. An exercise in synthesis, abstraction and coordination that seeks to simplify processes, reduce production times and, above all, to guarantee the consistency we want for the use experience. For this, the construction of Lexicon is based on the Atomic Design theoretical approach. A work methodology based on modularity that seeks to give a more hierarchical and organized logic to the creation of interfaces design systems. This methodology has been ideated and developed by the designer Brad Frost and is based on nonlinear process organized across five stages: Atoms, Molecules, Organisms, Templates and Pages. Lexicon site Lexicon Site is then presented as the necessary platform for the diffusion and access to Lexicon system by designers, developers or any other person involved in the creation of digital products. Mainly focused on Liferay community, but open to anyone who wants to make use of its content and also want to contribute with their own proposals and suggestions. Lexicon Site tries to collect all patterns created using Lexicon in Liferay products. This doesn't mean that all of them are reflected in Clay. Clay only implements those patterns that are of common use in several of our products and/or applications, providing a maintenance as they are more important not only for us but also for you. In this way, the components are labeled in the following way | Label | Usage | | ---- | ----- | | CLAY | Providing a link to the pattern implementation. | | PORTAL | Informing that the pattern is use in a concrete product or application. | | PENDING | The pattern has been designed and will be implemented either in Clay or a Product/Application. | Implement Lexicon Lexicon is not an implementation, it is just a set of patterns, rules and behaviors. Many different libraries could implement Lexicon. Liferay's Lexicon Experience Language web implementation is Clay.","srcFilePath":"src/pages/docs/lexicon/index.md","id":"lexicon","location":"/docs/lexicon/","url":"/docs/lexicon/"},"news":{"children":{"News":{"title":"News","description":"Keep updated.","layout":"guide","weight":1,"content":" June 27th, 2018 Stable version We are glad to announce that Lexicon has moved out from beta version to a stable version. We also want to highlight the improvements done from last release: The site has been adjusted to adopt the system font like we do in Lexicon. All images has been changed to adapt the typography form Source Sans Pro to San Francisco (system font for MacOS) A large number of patterns now include attributes sections where the patten anatomy is described. Examples have been added to many of our patterns and also descriptions have been reviewed. Moreover, now you can find our sketch library under resources section to build your own interfaces using Lexicon. April 24th, 2018 Beta release We are glad to announce that we are on beta right now. We will update style changes, already compromised, before leaving beta status. April 20th, 2018 General Update This update comes with many tiny improvements that allow us to communicate better: Charts: base layer interaction and different chart examples Forms: re-organized for better understanding Animations: pending to include the real animation. But a first introduction is there as reference. Labels: patterns have labelled to know if they are implemented by Clay or they are owned by any other team/application. Status table: to know in what status the design and implementation is. January 17th, 2018 General Update This update comes with many tiny improvements that allow us to communicate better: Do's and Don'ts have been included for several patterns as: badges, labels, table, actions definition and popover. This provides us with a more graphic way of defining examples. Multiple step form now includes an example to understand how the pattern is build in an use case. Text input localizable has been released. Card layout has been added inside layouts at Foundation. Vertical navigation has been updated with an example of collapsible menu in mobile. Sidebar documentation has been splitted in several pages for a better documentation purpose focusing on special needs. January 8th, 2018 Examples Examples of use have been added into table to make more clear the row hover action with images on what can be done or not. Moreover, multistep form has been updated with a layout example in a form to better understand how it must be applied. Last but not least, checkbox groups and radio groups examples with metrix have been offered. January 3rd, 2018 Sites A full set of components inside sites section is already available to build you own site widgets. This will allow you to transform old widgets into new ones towards looking for a better information architecture, structure, and refreshing design. November 28th, 2017 Layouts and Form Hierarchy As part of the improvement in Lexicon we want to clearly defined the different layout possibilities the we usually find in admin pages. Layout is part of our foundations as it belong to a series of principles to start builing interfaces with our system. Forms are now better definied as the hierarchy is expressed in a dedicated page. Slider has been defined also inside Forms section. November 20th, 2017 Charts and Sites Charts and Sites have been documented at their initial stage. Charts is a totally new pattern in Lexicon and with it we want to provide you a full set of principles related to it to improve accessibility, preception and interpretation. Sites tackles widgets for sites. Lexicon faces a huge improvement in this area towards improving not only the visual aspect but also the usability in some of our ADTs. Many improvements will come in upcoming dates in this area towards next portal release. November 13th, 2017 Updates Liferay is happy to announce a new version of Lexicon in alpha state. This Lexicon Evolution brings you a wider range of possibilities, new components and brand new color palette. Lexicon now worries more about accessibility, shorter interactions, and ways to achieve a better user experience never seen before in Liferay. This alpha version will become into beta as soon as Lexicon and Clay aligns.","srcFilePath":"src/pages/docs/news/News.md","id":"News","location":"/docs/news/News.html","url":"/docs/news/News.html"},"status":{"title":"Status","description":"Lexicon upcoming site status","layout":"guide","weight":1,"content":" Last Update June 26th, 2018 | Legend | | ---- | | &#9679; Done | | &#9679; In Progress | | &#9679; Pending | | Page | Lexicon | Clay CSS | Clay Component | | ---- | ----- | ----- |----- | | FOUNDATIONS | | Animations | &#9679; | NA | &#9679; | | Color | &#9679; | &#9679; | &#9679; | | Grid | &#9679; | &#9679; | &#9679; | | Layout | &#9679; | &#9679; | &#9679; | | Typography | &#9679; | &#9679; | &#9679; | | Writing style | &#9679; | NA | NA | | ALERT | | Alert Toast | &#9679; | &#9679; | &#9679; | | Alert Embedded | &#9679; | &#9679; | &#9679; | | BADGE | | Badge | &#9679; | &#9679; | &#9679; | | BUTTON | | Button | &#9679; | &#9679; | &#9679; | | Button icon | &#9679; | &#9679; | &#9679; | | Button icon and text | &#9679; | &#9679; | &#9679; | | Button dropdown | &#9679; | &#9679; | &#9679; | | Button group | &#9679; | &#9679; | &#9679; | | CARD | | Card image | &#9679; | &#9679; | &#9679; | | Card user | &#9679; | &#9679; | &#9679; | | Card file | &#9679; | &#9679; | &#9679; | | Card folder | &#9679; | &#9679; | &#9679; | | CHART | | Bar chart | &#9679; | &#9679; | &#9679; | | Doughnut chart | &#9679; | &#9679; | &#9679; | | Heatmap chart | &#9679; | &#9679; | &#9679; | | Line chart | &#9679; | &#9679; | &#9679; | | Pie chart | &#9679; | &#9679; | &#9679; | | Stacked bar chart | &#9679; | &#9679; | &#9679; | | Scatterplot chart | &#9679; | &#9679; | &#9679; | | CONFIRMATION MESSAGE | | Confirmation Message | &#9679; | NA | NA | | DROPDOWN MENU | | Dropdown menu | &#9679; | &#9679; | &#9679; | | FILE UPLOAD | | File upload | &#9679; | NA | NA | | FORM | | Checkbox, Radio, Toggle | &#9679; | &#9679; | &#9679; | | Actions definition | &#9679; | &#9679; | &#9679; | | Multi Step Form | &#9679; | &#9679; | &#9679; | | Multi Step Form Simplified | &#9679; | &#9679; | &#9679; | | Selectors | &#9679; | &#9679; | &#9679; | | Slider | &#9679; | &#9679; | &#9679; | | Text Input | &#9679; | &#9679; | &#9679; | | Text Input Group | &#9679; | &#9679; | &#9679; | | Text Input Localizable | &#9679; | &#9679; | &#9679; | | Text Input Variation Autocomplete text field | &#9679; | &#9679; | &#9679; | | Text Input Variation Search field | &#9679; | &#9679; | &#9679; | | Text Input Variation Labels input field | &#9679; | &#9679; | &#9679; | | Text Input Variation Date field | &#9679; | &#9679; | &#9679; | | Text Input Variation Numeric field | &#9679; | &#9679; | &#9679; | | Text Input Variation Password field | &#9679; | &#9679; | &#9679; | | ICONS | | Icons | &#9679; | &#9679; | &#9679; | | IMAGE SELECTOR | | Image selector | &#9679; | NA | NA | | LABEL | | Labels | &#9679; | &#9679; | &#9679; | | LINK | | Link | &#9679; | &#9679; | &#9679; | | LIST | | List | &#9679; | &#9679; | &#9679; | | LOADING INDICATOR | | Loading indicator | &#9679; | &#9679; | &#9679; | | MODALS | | Modals | &#9679; | &#9679; | &#9679; | | NAVIGATION | | Breadcrumb | &#9679; | &#9679; | &#9679; | | Header | &#9679; | &#9679; | &#9679; | | Navbar | &#9679; | &#9679; | &#9679; | | Vertical Nav | &#9679; | &#9679; | &#9679; | | PAGINATION | | Pagination | &#9679; | &#9679; | &#9679; | | Pagination bar | &#9679; | &#9679; | &#9679; | | POPOVER & TOOLTIPS | | Popover | &#9679; | &#9679; | &#9679; | | Tooltips | &#9679; | &#9679; | &#9679; | | PROGRESS BAR | | Progress bar | &#9679; | &#9679; | &#9679; | | SIDEBAR | | Sidebar | &#9679; | NA | NA | | Info Panel | &#9679; | &#9679; | &#9679; | | Product Menu | &#9679; | NA | NA | | TABLE | | Table | &#9679; | &#9679; | &#9679; | | Inline Edit Table | &#9679; | &#9679; | &#9679; | | TABS | | Tabs | &#9679; | &#9679; | &#9679; | | TOOLBAR | | Toolbar | &#9679; | NA | NA | | Management toolbar | &#9679; | &#9679; | &#9679; | ","srcFilePath":"src/pages/docs/news/status.md","id":"status","location":"/docs/news/status.html","url":"/docs/news/status.html"}},"title":"News","description":"Keep updated.","layout":"guide","icon":"lexicon-site-news","weight":4,"content":" July 22nd, 2017 License update Updates Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum. ","srcFilePath":"src/pages/docs/news/index.md","id":"news","location":"/docs/news/","url":"/docs/news/","childIds":["News","status"]},"resources":{"title":"Resources","description":"A series of links to previous versions of Lexicon and presentations done related to this design language.","layout":"guide","weight":5,"content":" {$page.description} Sketch library Creating your own interfaces using Lexicon is pretty easy using our Sketch library. Now, you can download it, practice and build your own interfaces. Download Presentations 2018 January Principles, grid, distances... are important elements to know how to craft inferfaces using Lexicon. This slide deck will help you to understand how to build your own components and how to use the most common templates. 2017 October Lexicon Evolution was presented in DEVCON, LNAS and LRESP in October 2017. This presentation shows the news and updates, and lines of work of our design system. Previous Lexicon Versions Lexicon Version 1.0","srcFilePath":"src/pages/docs/resources/index.md","id":"resources","location":"/docs/resources/","url":"/docs/resources/"},"patterns":{"children":{"actionsDefinition":{"title":"Actions Definition","description":"This page defines the usage of certain actions as Delete vs Send to Recycle Bin, Select vs Choose ...","layout":"guide","weight":1,"content":" {$page.description} Delete vs Send to Recycle Bin Delete The action of deleting an element or a set of elements implies that it is not possible to recover them from anywhere and they will disappear forever. This icon can be also used for clearing actions like clear an input field content. As this is a strong action, you must trigger the user with a confirmation message, always native and not styled by Lexicon. Do Don't Don't Send to Recycle Bin The action of sending to recycle bin implies that recovering the element is possible. Therefore, it doesn't imply a complete removal of the element. Do Don't Don't Cancel Cancel and close differ much from deleting or sending to the Recycle Bin. This action can be found in modals at the top right corner. Do Don't Don't Done Use it as the primary button copy in all modal that display a table / list / card view to select one or several elements. Do Don't Select vs Choose The convention in Lexicon is to use Select instead of Choose, as Select is a more formal word. Select means \"to carefully choose\"; it also means \"to use a mouse or keystrokes to mark something on a computer screen\". Therefore, Choose can not have the implication we want on interaction design. Do Don't ","srcFilePath":"src/pages/docs/patterns/actionsDefinition.md","id":"actionsDefinition","location":"/docs/patterns/actionsDefinition.html","url":"/docs/patterns/actionsDefinition.html"},"alerts":{"title":"Alerts","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/alerts.html","description":"Alerts are used to capture the attention and inform the user in a more or less intrusive way.","layout":"guide","weight":1,"content":" {$page.description} Usage Alerts are possible to define in 4 different colors corresponding to status colors. Alerts must always have the status icon and the keyword that defines the message type and in semibold. Alerts can have multiple text lines. All alerts types can contain links. Those links are defined in primary color. Alerts can be defined as temporary in the case of toast and stripe. In these cases the delay time is: 10 sec if there are actions associated. 5 sec if there are no actions associated. In both cases the time freezes on hover to allow more time to the user to interact with the alert message. On mouse out the countdown continues. Types | Type | Usage | | ----- | ----- | | Error | Red color. This alert indicates that something went wrong after performing an action. (E.g.: Form couldn’t be saved because some data was missing) | | Success | Green color. Success alert messages will appear when everything was ok. (E.g.: “The user was created successfully”). | | Warning | Yellow color. This alert lets users know that the action they performed was done but there are some issues with it. (E.g. The item was created but with there were some issues). | | Information | Blue color. Information alerts are used to inform users about things that occur while they are carry out a task. | More information about color definitions can be found at colors page. Attributes An alert has 4 different attributes: The status icon. Type text. Descrition text. Close button. That might appear or not depending on the use you give to the alert in a context. Please see the following image to understand how an alert is built: Variations Toast This type of alert is specific for toast messages. This type of messages appear on the top right corner of the screen. The maximum width of a toast message is 360px and the height can vary depending on the number of rows. It always have a close action. This alert type must appear at the bottom left side of the screen. 24px separation from the left and from the bottom. In case they are configured to close automatically, the time will be 10 seconds. Example of use: Embedded Embedded alerts are thought to be used inside context as forms. Usually you will only need to use the information one. Its width depends on the container with you use it, always respecting the container margins to the content. The close action is not of mandatory use. Example of use: ","srcFilePath":"src/pages/docs/patterns/alerts.md","id":"alerts","location":"/docs/patterns/alerts.html","url":"/docs/patterns/alerts.html"},"badges":{"title":"Badges","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/badges.html","description":"Badges help highlight important information such as notifications or new and unread messages.","layout":"guide","weight":1,"content":" {$page.description} Badges have circular borders and are only used to specify a number. Usage Badges can be of different types as it can be seen in the previous image. Apply them properly depending on the context. You won't always need a badge to identify a number, in those cases plain text is an option to take into account. Badges are used only for integers. Badges can not be close or link to another a page. They are only used as informative text. Badges are not thought to always indicate the exact number of elements. In that case please use plain text. Badges work for exact numbers up to 999. From there we use K from Thousands (5K for 5.231) , M for Millions (2M for 2.100.523). Red background color badge is only dedicated to: Notifications: always placed nearby a user profile or a Product menu option. Errors: in tables and/or lists. In case you need a pattern where to write non-numeric values, labels is the pattern to use. Do's and Don'ts Badges can be use near text but a minimum distance of 8px must be always kept. Do Don't Attributes Height: 18px Border: 1px Font-size: 12 ","srcFilePath":"src/pages/docs/patterns/badges.md","id":"badges","location":"/docs/patterns/badges.html","url":"/docs/patterns/badges.html"},"buttons":{"title":"Buttons","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/buttons.html","description":"Buttons are a basic ui elements that communicate and initilize actions when the user interacts with them.","layout":"guide","weight":1,"content":" {$page.description} Types Primary The primary button is always use for the most important actions. There can't be two primary actions together or near by. Secondary The secondary button is always use for the secondary actions. There can be several secondary actions near by. Link Used for many Cancel actions. States Default state Hover state Active state Disable state Sizes Default Used for main page actions like Save or Cancel. 40px height. Small Used for actions inside a page, like dropdowns, button groups, split buttons. 32px height. Do's and Don'ts When placing buttons in a same row, use button of same height. Do Don't Caps lock is not allowed in buttons Do Don't Text must be always wrapped in one line. Do Don't Borderless button must be always before of after a set of bordered buttons. Do Don't Variations Secondary borderless Secondary borderless button is meant to be used in those cases as toolbars where the secondary button would be too heavy for the pattern design. In this way the design gets cleaner. Icon button Buttons can icons instead of text and for that icons need to be monospaced inside the button. Lexicon do not use buttons with text and icon, or text and loading indicator. Icon buttons are used intensively in management bars. This button variation can be primary, secondary or borderless type. Icon and text button This button type is used only in sites and not in administration. The icon emphasizes and helps to understand the action. The label must be the same icon purpose. Block level button All buttons can also be configured at block level. Use this configuration in those cases that you need the user to realize there is an important action to be done. It could be used as a load more action below a list, as an example. Please do not use it in forms. Be always careful with the type button to use, primary is not always the best choice neither the only configuration. Dropdown button Dropdown buttons are always used together with a dropdown menu. This button variation can be secondary or borderless type. Split button Split buttons are used in those cases where you need to offer the user a quick main action but also secondary actions. Button group Button groups are used to switch between complementary views for example, but they must never be used for complementary actions and \"Change and Cancel\" or \"Save and Cancel\". In those cases the use of single buttons is the correct solution. Plus button Normally placed in toolbars, allows to have adding actions over a dataset. The kind of elements to add with this button are of the same nature and folders. Sometimes it only has a unique action, some others it has more. Visit Dropdown menu Sorting actions to know more. Action button It is used when a set of contextual actions are needed over an element or a dataset. This button displays a set of actions inside a dropdown menu. The actions must be sorted in an specific way, please visit Dropdown menu Sorting actions to know more. ","srcFilePath":"src/pages/docs/patterns/buttons.md","id":"buttons","location":"/docs/patterns/buttons.html","url":"/docs/patterns/buttons.html"},"cards":{"title":"Cards","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/cards.html","description":"Cards are a specific form of data visualization focused mainly on displaying images.","layout":"guide","weight":1,"content":" {$page.description} Usage Cards is a pattern that is heavy on image usage, therefore we recommend to use it only if you have images associated to your content. A good example of this could be your users database or an image library. Cards are not meant to compare information in an exhaustive way but a light way. In case you need exhaustive comparison and not based on image comparison, you must use a table. Cards in Lexicon are open to many configurations. We provide a flexible card layout for you to configure it as you want. Later on this page we provide a series of examples we use in our systems for you to get inspired. Card interaction A card can have a checkbox, a radio or none of them. Selecting a card is only possible by using the checkbox or radio, and the image area. Main text in the card can be configured to navigate In case of: Folder: it navigates to the next level. File / Image / User: it navigates to its detail view. Do never use it for preview. Preview is always a secondary action placed inside the action menu. If the link drives the user out of the site, please identify visually that this link will open in a new page. Layout By providing a flexible layout, Lexicon opens you a wider range of possible configurations for your card. Every element can be used or deleted adapting it to your specific needs in each use case. As you can see in the following image, a card is shaped by: Image area: main element in this pattern. 16:9. Checkbox or radio: useful when working together as a visualization type with a management bar. Sticker or User image: Useful to identify the file type or the owner. Information area Text lines of different importance: relevant information. Actions menu: actions associated to the card Among these elements, the only one that can't be removed for the pattern meaning is the image. Image card Used in image/document galleries. Default Hover Active Empty Image with different ratios It is important to highlight that images can have different sizes. To provide the end user with that relevant data about the image Lexicon incorporates cards that allow this feature. Attributes Checkbox Image Sticker: file type Title Actions button Detail or short descriptive text Label: status identifier User card User card is used to represent users. The user can be represented by its user image or up to two initials extracted from the uses name or name + surname. File card File card is used to represent files different to images. Folder card This card variation is meant to have horizontal representations of information. This card has the same amount of elements as the previous explained. The main purpose of this card is to represent folders, therefore we allow to remove the image in this card type. In this case, only the checkbox is used to select. Sections Card sections help to separate different contents by a certain categorization or typology. Examples of use Examples can be found in dataset template. ","srcFilePath":"src/pages/docs/patterns/cards.md","id":"cards","location":"/docs/patterns/cards.html","url":"/docs/patterns/cards.html"},"columns_view":{"title":"Columns View WIP","titleLabel":"Portal","description":"A visualization type that allows to move faster through several depth levels at same time.","layout":"guide","weight":1,"hidden":"yes","content":" {$page.description} Usage When to use it Columns view, also known as Miller columns or Cascading list, is a visualization type that allows to move faster in a tree view seeing several depth levels at same time. Is a good pattern to navigate through dictionaries being able to see and create categories in a fast way. But it can fit well in other scenarios when just the visualization is necessary to know the depth of the tree or discover elements at different levels. When must not use it Do not use this pattern if you need to show information further from the item title. Interaction In this pattern it is pretty important to always update the row state in each of the columns and it is also important to update the breadcrumb as it is an important component in this pattern as it provides feedback on the element position in the tree. ","srcFilePath":"src/pages/docs/patterns/columns_view.md","id":"columns_view","location":"/docs/patterns/columns_view.html","url":"/docs/patterns/columns_view.html"},"confirm_message":{"title":"Confirmation Message","description":"Confirmation messages communicate the users critical situations and irreversible actions.","layout":"guide","weight":1,"content":" {$page.description} Usage When to use it Confirmation messages are used in those scenarios where a critical situation appears. Such situation can be a complete change of context, or an action that could be not reversed such as a site deletion. There are two main use categories that helps you to identify the correct situations to use confirmation messages: Risk action: The action the user is going to perform has significant consequences that cannot be undone or easily undone. Ex: site deletion. Unintended consequence: There is an important side effect on the action the user is taking that most probably will make her feel lost. Ex: Site switch, where there is a complete change of context including user permissions. It is very important to use this pattern only when it is needed as it is a very intrusive pattern, so take a time to think if your case is included in the previous set. This message type should be rarely needed in the system. When must not use it Error prevention: put first the effort on your interface to guide the user on what is going to happen. Clear copy’s prevent the usage of confirmation messages. Feedback: providing extremely clear feedback can prevent the usage on confirmation messages. Undo actions: if action has an undo action you must never use a confirmation message. A clear example is “Move to Recycle Bin”. Don’t use it if it is not really needed. How to write a confirmation message Writing a good confirmation message is relevant to make it really effective in such exclusive situation: Do not write generic and open questions. Ex: Are you sure? Be clear and concise. Provide exact data to your user so there is no uncertainty on the action to be confirmed. Address your questions and statements so they can be easily answered with \"Ok\" and \"Cancel\" as they are forced by the browser. Implementation Confirmation messages are browser native. Therefore Lexicon does not style them. Browser native confirmation messages are accessible, and work perfectly in every device. ","srcFilePath":"src/pages/docs/patterns/confirm_message.md","id":"confirm_message","location":"/docs/patterns/confirm_message.html","url":"/docs/patterns/confirm_message.html"},"dataset_display":{"title":"Dataset Display","description":"A combination of components that configure the main data management pattern of the system.","layout":"guide","weight":1,"content":" {$page.description} A dataset display is the combination of a management bar with one or many data visualization types and a possible mechanism of pagination. The most common visualization types used are table, list and card. Previous Next Usage This pattern is used when the elements of the visualization require collective management, therefore the management bar becomes important as it facilitates tools needed to work with the dataset. This pattern can be only used one time in a page. Use it is you want to have several visualizations for a set of data. Use it if you want to perform actions over the data at individual level or group level. Only use the needed visualizations. Not all visualizations are appropriate for all data types. When the result of a filter is an empty result, the filter must be possible to be changed to another filter not blocking the management bar usage. Always offer a descriptive message on empty datasets due to no elements or no match in the search. Use a list view If you need to display a homogeneous sets of basic data. If you need to sort, group, or filter simple data sets. If you don’t need to compare between attributes of different items. If you need to display a single-level hierarchy. If you need to provide a quick identification of the basic content of a list item at a glance. Use a table view If you need to manage complex data sets that need to be extensively sorted, grouped, filtered, or edited.. If you need to compare between attributes of different items. If you work with complex hierarchies. Use a grid view If the primary content consists on images. Use of other visualization methods Other visualization methods are also possible, such as map view, but you will have to implement it by yourself as it is not the most common case we have in our platform. Empty state It is important to let the user know what happens in empty states and let them know what has happened and how to perform actions to move out from that empty state. All these scenarios can be found in detail at empty states page. Individual actions Individual actions are all those actions that an element has. This actions are always possible to reach from the element itself through the actions menu. Some of this actions are also placed in the management bar when only one element from the dataset is selected. These actions are always represented by a metaphor, , they are buttons with icon. Only those actions that can be easily represented by an icon will be there. Not all possible represented by an icon must be there, only the ones considered as more relevant. Collective actions Collective actions are shown in the management bar when more than one element is selected in the dataset. In case there are collective actions that don't have an icon representation the can be placed in a dropdown triggered from the actions button. Filtering Use filter only when you need them. When a filter is applied from the management bar to a visualization type, the visualization type itself needs to update to show the specific data requested by the user. A user is only able to filter by the elements that are displayed. Hidden elements can not be used for filtering as they must not appear among the filtering options. When the result of a filter is an empty result, the filter must be possible to be changed to another filter not blocking the management bar usage. Sorting When sorting is applied from the management bar to a visualization type, the visualization type itself needs to update to show the specific data requested by the user. A user is only able to sort by the elements that are displayed. Hidden elements can be used for sorting as they must not appear among the sorting options. Tables are able to show the sorting applied in the column header. This update must be done in both ways: When the user sorts using the column header the value must be marked on the sort panel and the arrow must indicate the “sort direction”. When the user sorts using the sort panel and button, the action must be reflected in the appropriate column header. Selection When an item is selected in any of the views the management bar must change state 2. This state has a different background color so the user can notice the change. Depending on the number of items selected in the visualization, the number of actions adapt. One item selected: The available actions are the same as in the row. More than one item selected: The available actions are the ones that apply to the group. The check box in the management bar selects/unselects all elements in the visualization. Drag and drop example Change view Changing view is something to have only when there is more than one visualization. Otherwise, this pattern must not appear in the management bar. ","srcFilePath":"src/pages/docs/patterns/dataset_display.md","id":"dataset_display","location":"/docs/patterns/dataset_display.html","url":"/docs/patterns/dataset_display.html"},"dropdowns":{"title":"Dropdown Menu","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/dropdowns.html","description":"A dropdown menu dispalys a list of options related to the element that triggers it.","layout":"guide","weight":1,"content":" {$page.description} Usage Dropdowns are used to list a set of options that are not easy to manage in the screen. This mechanism helps to clean-up the screen making everything more implicit. Dropdowns are usually triggered from a dropdown button or a button with icon, as the actions button. These are the two most extended cases in Lexicon. Closing a dropdown can be done by: Selecting an option in the panel, if they are mutually exclusive. Clicking on the button that triggered it. Clicking outside the panel. A dropdown menu can contain any kind of basic form component / element like text field, list of options, list of options with radios, list of options with checkboxes, or button. Dropdowns have a maximum width of 240px. When an entry text doesn't fit into the available space, use 2 lines. The text in each entry should be short and specific enough to not use more than one line. Maximum height is established in 600px for desktop and 400px in mobile. Vertical scroll is allowed when the content exceeds the limit. The distance from the button to the dropdown is 8px. Types Default The default dropdown is just a panel not prepared for scrolling the content inside it. Use this type when the number of options you want to offer is short or the panel is big enough to contain all the elements you want to use. Dropdown with dividers Dropdown menu with dividers are thought to be used in actions menus. Dividing the actions by context of use help users to find actions. Dropdown with checkbox or radio Dropdowns can be configured to have checkboxes and/or radio groups. A checkbox configuration can be suitable to filter in or out dataset elements. While, a radio configuration can be suitable to establish the order criteria in a dataset. Dropdown with search field Sometimes action menus face problems with the number of elements they contain. This dropdown menu variation helps in those contexts where the set of options is large and a search mechanism helps to reduce the search time and task complexity. Dropdown with left icons Dropdown menus with left icons are suitable for process bars (wizards) where there is a need to display a dropdown menu when the number of steps do not fit the screen. Dropdown with right icons Dropdown menus with left icons are suitable for process bars (wizards) where there is a need to display a dropdown menu when the number of steps do not fit the screen. In this case, the step number has a high relevance, therefore the icon is placed on the right side. Dropdown with groups This dropdown menu variation is created to be used with the management bar Filter and Order dropdown button. This configuration is thought to clean the management bar providing the user with more specific mechanisms to find data. The button in a dropdown menu can be either primary or secondary depending on the application needs. Sorting actions Dropdown menu from actions button Guideline: (not all steps are always in use) Order by context (use a separator line between each of the groups): Primary commands: edit, preview, open… Secondary commands specific of the object: expire, view history Transfer commands: copy, duplicate, move, export, import Object settings: permissions, configuration Object commands: delete, move to the recycle bin General rules Group size must be less or equal than 7. The total number of elements must not exceed 15 items. Use separator lines between groups. Do not increase the menu complexity with submenus. Order inside a group must be use frequency, in other case use alphabetic order. Disabling actions: Do never remove actions. If an action is not available for an item due to its state, disable it. Exception: remove the action if the item by its nature cannot perform the action. Actions menu actions don’t have icons. Using many icons can increase the reading time of the menu. Complementary actions must together (Ex: Lock, Unlock) When one is able the complementary must be disabled. Sometimes both would be able at same time (undo / redo) Only present the actions that make sense in the context. Do not overload the menu. This doesn't mean to remove disabled items. Dropdown menu from Plus button Sometimes the plus button use in certain contexts need more than a single action. For those cases please follow the following set of rules: The left configuration suggest the user the possibility of having favorites elements. Favorites are selected in a modal window and the outcome is reflected as in the right image. Out of the favorites the order is ruled as follows: First two elements are the most used ones. The rest are displayed in alphabetical order The previous image shows a case with scrollbar to let your understand the scrollable area. Guideline: The menu must be splitted in 2 areas: Primary actions: always contain the generic actions. Example: folder. Secondary actions: are sets of actions that attend a certain category, for example: structures, document types… Secondary organization: Make a first group of favorites in case they exist. Make a second group with the rest of actions. Display a maximum of 7 actions between favorites and not favorites. Show a message to allow the user know the total number of actions inside the category. Example: “Showing 7 of 203 items” Include a More area to give access to the modal that contains the rest and the configuration of favorites. Sorting inside each group: Place first the most used Place the rest in alphabetical order. The limit of this dropdown menu is 15 actions. Attributes ","srcFilePath":"src/pages/docs/patterns/dropdowns.md","id":"dropdowns","location":"/docs/patterns/dropdowns.html","url":"/docs/patterns/dropdowns.html"},"emptyStates":{"title":"Empty States","titleLabel":"Portal","description":"Empty states provide users with feedback on the reasons behind that fact and what is possible to be done.","layout":"guide","weight":1,"content":" {$page.description} Usage What animation to use and when? Several animations are created to cover different scenarios. Right now there are 3 different animations and here we can see them used in different contexts. Empty dataset: there are no elements in the data set at a certain level Empty search results: filters applied or search result provides 0 results Empty state for success: the user has emptied the dataset for a good end. Removed all notifications. Get to a clean state. When to not use the animation? Animations are used to catch the user attention. Therefore, animations are intended to appear only once in the screen and not multiple times. In our case we want these animations to also be in the wide components that are usually the main focus of attention. On narrow areas we prefer to be more discrete and to avoid the animation. Attributes Inside a dataset display Animation Text:limited to 1 line Message: limited but we recommend to use a maximum of 30 words. Do not make messages personal unless they work on favor to the user. Do not leave one word alone in a line. Do not use your. Do not use exclamation marks. Use common language and not jargon. Button: secondary button The margin from the container to the top element will be of 80px Outside a dataset display In this case we are in an area that is tiny and we won't use an animation. To counteract the lack of animation we use the primary button to cacth the eye attention. Text: limited to 1 line Message: as in the previous case Button: primary small button. ","srcFilePath":"src/pages/docs/patterns/emptyStates.md","id":"emptyStates","location":"/docs/patterns/emptyStates.html","url":"/docs/patterns/emptyStates.html"},"fileUpload":{"title":"File Upload","titleLabel":"Portal","description":"File Uploader is a pattern that allows the user to select and upload images to the system.","layout":"guide","weight":1,"content":" {$page.description} Simple File Upload Simple file upload is used to upload a simple file element. Multiple File Upload Inside this categorization we have two different patterns: file uploader and image uploader. Both are pretty similar but the second one is more visual and adapted to the situation. Both uploaders share the same upload area which works in the following way: It must always have 2 different states: Default Message: to clarify file extension permitted, max size of each file. Secondary button: as not always users would want to user the drag and drop feature. The button opens the operating system file uploader with the possibility of selecting multiple files. Active It contains an animation that invites users to drop documents on dropover state. Once files have been added to the upload system, there must be always clear options to upload more files, explicit button and drag and drop option. The scroll must be only vertical if needed. Each file can be deleted individually. Each file can retry the upload individually File Uploader File uploader admits any kind of file further that images as it can be pdfs, docs, etc. After dropping files in the area, a list with the upload status is displayed allowing the users to see the upload status of each single file. Files that didn't complete the upload process provide the option to retry the upload. Every file must be always possible to be removed. In this example the file uploader counts with a form to predefine a certain configuration for the files uploaded. Files can be in different states: Default state: when the file is already uploaded Upload state: while the is the upload process Error state: the file upload has failed Image Uploader Image uploader only admits image file types. After dropping images in the area, a images grid appears allowing the user see the upload process. The drag and drop area hots the image grid. This are must have a vertical scroll. The cell next to last uploaded image must have a \"+\" to invite the user to upload more files. Clicking in that cell opens the file upload for the specified files. Each images is represented by its squared thumbnail. Images that didn't complete the upload process provide the option to retry the upload. Every image must be always possible to be removed. Images can be in different states: Upload state: while the is the upload process. Left side default state, right side hover state. Error state: the file upload has failed Default and hover image states: when the file is already uploaded It can be the case that the image uploader requires of checkboxes for a specific requirement ","srcFilePath":"src/pages/docs/patterns/fileUpload.md","id":"fileUpload","location":"/docs/patterns/fileUpload.html","url":"/docs/patterns/fileUpload.html"},"icons":{"title":"Icons","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/icons.html","description":"An icon is a visual metaphor that represents the concept that lie behind an idea and/or an action.","layout":"guide","weight":1,"content":" {$page.description} Usage Icons can be used only when the metaphor is direct and clear. In case there is not a good icon to represent the concept you want to transmit, it will probably better to use words. Icons must be reserved to broad accepted visual ideas. Size usage for designers Use a 16px box for icons of 16px. Size usage for developers Icons in Lexicon have no size. The size of the icon is established by its container. By default it would be 16px. All the icons available to use are in the Lexicon Icon Library. Don't use icons from outside this library. Switch icon libraries completely in case Lexicon icons set is not enough for you. Liferay icon library Liferay has its own icon library created for the purposes of the projects that use Lexicon. {foreach $icon in $page.icons} {$icon} {/foreach} Please, read this guide on how to create icons for Lexicon. Language flags People tend to have pretty strong opinions on whether flags should be used as a visual cue for indicating a language, mainly because in many parts of the world, the flag may have cultural and geographic meanings that we might not be aware of, or the flag itself isn't fully accurate to the dialects spoken in that region. While we understand that reasoning, we've found that the times they are actually needed (when a user is not familiar with the currently displayed language) somewhat eliminates using other mechanisms, such as the name of the language (since the current language could be in an entirely different character set). Given this, there is often at least some familiarity with the identity of a country that speaks a shared language. {foreach $flag in $page.flags} {$page.flagData[$flag]} ({$flag}) {/foreach} Other icon libraries Font Awesome and Glyphicons are good alternatives in case you don't want to use Lexicon icon library. ","srcFilePath":"src/pages/docs/patterns/icons.md","id":"icons","location":"/docs/patterns/icons.html","url":"/docs/patterns/icons.html","icons":["add-cell","add-column","add-role","add-row","adjust","align-center","align-image-center","align-image-left","align-image-right","align-justify","align-left","align-right","analytics","angle-down","angle-left","angle-right","angle-up","announcement","api-lock","api-web","archive","arrow-up-full","asterisk","audio","autosize","bars","bell-off","bell-on","blogs","bold","bookmarks","box-container","breadcrumb","calendar","camera","cards","cards2","caret-bottom-l","caret-bottom","caret-double-l","caret-double","caret-left-l","caret-left","caret-right-l","caret-right","caret-top-l","caret-top","categories","chain-broken","change","check-circle-full","check-circle","check-square","check","chip","code","cog","columns","comments","community","compress","control-panel","custom-field","custom-size","cut","date","decimal","desktop","devices","diagram","diary","document","documents-and-media","download","drag","dynamic-data-list","dynamic-data-mapping","edit-layout","effects","ellipsis-h","ellipsis-v","embed","envelope-closed","envelope-open","environment-connected","environment-disconnected","environment","exclamation-circle","exclamation-full","expand","file-script","file-template","file-xsl","filter","flag-empty","flag-full","folder","format","forms","full-size","geolocation","globe","grid","h1","h2","hashtag","heart","hidden","home","horizontal-scroll","hr","import-export","indent-less","indent-more","info-book","info-circle-open","info-circle","info-panel-closed","info-panel-open","information-live","integer","italic","link","list-ol","list-ul","list","live","lock-dots","lock","logout","magic","mark-as-answer","mark-as-question","merge","message-boards","message","mobile-device-rules","mobile-landscape","mobile-portrait","moon","move","myspace","number","oauth","open-id","order-arrow-down","order-arrow-up","order-arrow","organizations","page-template","page","pages-tree","paperclip","paragraph","password-policies","paste","pause","pencil","phone","picture","play","plug","plus-squares","plus","polls","print","product-menu-closed","product-menu-open","product-menu","propagation","question-circle-full","question-circle","quote-left","quote-right","radio-button","redo","reload","remove-role","remove-style","reply","repository","restore","rss-full","rss","rules","search","select-from-list","select","separator","share-alt","share","sheets","shopping-cart","shortcut","simulation-menu-closed","simulation-menu-open","simulation-menu","site-template","sites","social-facebook","social-linkedin","staging","star-half","star-o","star","sticky","strikethrough","subscript","suitcase","sun","superscript","table","table2","tablet-landscape","tablet-portrait","tag","text-editor","text","textbox","third-party","thumbs-down","thumbs-up-arrow","thumbs-up","time","times-circle","times","transform","trash","twitter","underline","undo","unlock","upload","urgent","user","users","vertical-scroll","video","view","vocabulary","warning-full","warning","web-content","wiki-page","wiki","workflow"],"flags":["ar-sa","bg-bg","ca-ad","ca-es","cs-cz","da-dk","de-de","el-gr","en-au","en-gb","en-us","es-es","et-ee","eu-es","fa-ir","fi-fi","fr-ca","fr-fr","gl-es","hi-in","hr-hr","hu-hu","in-id","it-it","iw-il","ja-jp","ko-kr","lo-la","lt-lt","nb-no","nl-be","nl-nl","pl-pl","pt-br","pt-pt","ro-ro","ru-ru","sk-sk","sl-si","sr-rs-latin","sr-rs","sv-se","th-th","tr-tr","uk-ua","vi-vn","zh-cn","zh-tw"],"flagData":{"ar-sa":"Arabic (Saudi Arabia)","bg-bg":"Bulgarian (Bulgaria)","ca-ad":"Catalan (Andorra)","ca-es":"Catalan (Spain)","cs-cz":"Czech (Czech Republic)","da-dk":"Danish (Denmark)","de-de":"German (Germany)","el-gr":"Greek (Greece)","en-au":"English (Australia)","en-gb":"English (United Kingdom)","en-us":"English (United States)","es-es":"Spanish (Spain)","et-ee":"Estonian (Estonia)","eu-es":"Basque (Spain)","fa-ir":"Persian (Iran)","fi-fi":"Finnish (Finland)","fr-ca":"French (Canada)","fr-fr":"French (France)","gl-es":"Galician (Spain)","hi-in":"Hindi (India)","hr-hr":"Croatian (Croatia)","hu-hu":"Hungarian (Hungary)","in-id":"Indonesian (Indonesia)","it-it":"Italian (Italy)","iw-il":"Hebrew (Israel)","ja-jp":"Japanese (Japan)","ko-kr":"Korean (South Korea)","lo-la":"Laotian (Laos)","lt-lt":"Lithuanian (Lithuania)","nb-no":"Norwegian (Norway)","nl-be":"Dutch (Belgium)","nl-nl":"Dutch (Netherlands)","pl-pl":"Polish (Poland)","pt-br":"Portuguese (Brazil)","pt-pt":"Portuguese (Portugal)","ro-ro":"Romanian (Romania)","ru-ru":"Russian (Russia)","sk-sk":"Slovak (Slovakia)","sl-si":"Slovenian (Slovenia)","sr-rs-latin":"Serbian (Serbia)","sr-rs":"Serbian (Serbia)","sv-se":"Swedish (Sweden)","th-th":"Thai (Thailand)","tr-tr":"Turkish (Turkey)","uk-ua":"Ukrainian (Ukraine)","vi-vn":"Vietnamese (Vietnam)","zh-cn":"Chinese (China)","zh-tw":"Chinese (Taiwan)"}},"imageSelector":{"title":"Image Selector","titleLabel":"Portal","description":"Image selector allows the user to select images from a grid prioritizing over other metadata.","layout":"guide","weight":1,"content":" {$page.description} Usage Use this pattern only for image selection. The elements placed in the grid must be of any image type that can display a previsualization in the form of a thumbnail. Simple and multiple selection must be possible. Single selection closes the modal on image selection. Multiple selection allows to select as many images wanted and the modal is closed with modal “Done” button. Hovering an image allows to see its title name. Long titles have ellipsis in the middle allowing to see the end of the title to differentiate between image versions. Image titles are always shown in touch interfaces. Image status Default Hover Selected Image selector example in desktop: In mobile as there is no hover state all images are forced to have always the title present. ","srcFilePath":"src/pages/docs/patterns/imageSelector.md","id":"imageSelector","location":"/docs/patterns/imageSelector.html","url":"/docs/patterns/imageSelector.html"},"labels":{"title":"Labels","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/labels.html","description":"Labels are a visual pattern used to categorize information providing quick and easy recognition.","layout":"guide","weight":1,"content":" {$page.description} Usage Use labels to organize groups of items in your application. Labels have rounded borders by default. Sizes | Size | Usage | | ---- | ----- | | | Small: Use it in contexts where its relevante is not major. Use it always in capital letters. | | | Default: Use it for marking states. The use of lowercase is valid in this option| Do's and Don'ts Labels can't be used together with badges. Do Don't Labels can only have only line of text displaying the entire content. Do Don't Labels never allow ellipis. Do Don't Variations Label simple Used to identify, tag content, show status, to filter content or even to provide navigation to elements of same identification. It can be used with status colors. Label removable Used in filter bars, categories, etc. Always in default size and without status color. Use it only in default size. Label with link Used in sites to link to related content. Attributes Small size metrics: Default size metrics: ","srcFilePath":"src/pages/docs/patterns/labels.md","id":"labels","location":"/docs/patterns/labels.html","url":"/docs/patterns/labels.html"},"link":{"title":"Link","description":"Also known as hyperlink, the link is a clickable (text or image) element used for navigation purposes.","layout":"guide","weight":1,"content":" {$page.description} Usage Use links only for navigation. A link must not trigger other kind of action. Do not use a link to trigger an action that could trigger a button. If this is the case use button link type. Types Inline Link Use an inline link text element inside of a text sentence or paragraph. A inline link element flows with other text elements. Attributes: Color: primary blue Font weight: inherit Hover: primary blue hover color + underline Single Link Used for stand-alone hyperlinks. Can be a text or an image. Attributes: Primary Text Alone Link Color: primary blue Font weight: semibold Hover: primary blue darken 5% color + underline Secondary Text Alone Link Color: secondary gray Font weight: semibold Hover: primary gray color + underline Image No style Title Link Used for links associated to list item titles like Dataset Display (stacked list, table or cards), asset title, blog entry teaser title … Example 1: Example 2: Example 3: Attributes: Color: inherit Font weight: inherit Hover: underline As a summary and to see all acting at same time: External Link For hyperlinks that point at (target) any domain other than the domain the link exists on (source) we provide a tooltip specifying this behavior. For accessibility purposes we also provide an icon to illustrate this behavior. This icon is visually hidden by default and only accessible on focus or when using assistive technologies such as screen readers. ","srcFilePath":"src/pages/docs/patterns/link.md","id":"link","location":"/docs/patterns/link.html","url":"/docs/patterns/link.html"},"list":{"title":"List","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/list.html","description":"Lists are a visual representation of a dataset based on groups of related content organized vertically.","layout":"guide","weight":1,"content":" {$page.description} Usage List is a visual representation of a dataset that provides more flexibility for arranging the data to display than a table and that is less visual explicit than a card view. It is useful for comparing entries among them that do not need exhaustive comparison. In case you need exhaustive comparison use the table view. A list allows you a free way of displaying information. While the table isn't meant to have several text labels in a column, list is the pattern for doing that, as you can see in the following examples. Not all the element in a list entry are mandatory, feel free to delete and include the ones you need. When a list is used together with management bar, the list entries must include the checkbox, as the selection and actions are reflected in the management bar. Row states Default states Hover state Selected state Row interactions A list entry can have a checkbox, a radio or none of them. Selecting a row is only possible by using the checkbox or radio depending on the selection type desired in the list. An interaction with the background does not produce row selection. Text elements in the row can be configured as links to navigate. A row can have none or several actions associated. When there is only one action and it can be represented by an icon, you don't need to make use of the actions menu. Otherwise, use the actions menu on the right side of the row. The main text is usually used as an action: In case of: Folder: it navigates to the next level. File: it navigates to its detail view. Do never use it for preview. Preview is always a secondary action placed in the row action menu. If the link drives the user out of the site, please identify visually that this link will open in a new page. Content format and alignment Main text must be always in semibold. In order to favor legibility an easiest way to identify content within a list item, the width of the main content won’t go further than the 50% of the row on wide screens. Inside the main content group there won’t be more than three elements stacked. However, the row can grow vertically if the elements need more vertical space, but never more than two lines. In those cases when a short description is needed this would be placed, as said before, aligned on the right of the main content and will extend until the tools. This description won’t be more than two lines long. Text elements can’t fill more than two lines. In the case that a text element is longer, we will use an ellipsis. Sections List sections help to separate different contents by a certain categorization or typology. Example of use More examples can be found in dataset template. Responsive Text elements can’t fill more than two lines. Ellipsis will be used to suggest more content available when is impossible to show all in a small screen. These ellipsis won’t be actionable. They are only indicative. The whole content will be showed on the item full description state. In case a list row has tags they can’t occupy more than one line. In the case that a tags row is longer, use an ellipsis. NOTIFICATIONS PORTAL List entries may need support for notifications. This is solved visually by placing a 8px width line on the left side of the row. ","srcFilePath":"src/pages/docs/patterns/list.md","id":"list","location":"/docs/patterns/list.html","url":"/docs/patterns/list.html"},"loading_indicator":{"title":"Loading Indicator","titleLabel":"Portal","description":"Loading indicator shows the user that an external process, like a connection, is being executed.","layout":"guide","weight":1,"content":" {$page.description} Usage This feedback mechanism is essential for the user to understand that something is happening. Please remember to include it when there is a connection to a server and at the same screen shows the answer to the user. Please don’t use spinners inside buttons. In case you need a spinner for an action triggered by a button, place the spinner to one of the sides of the button. Types Default Size Make a responsive usage of the sizes that help the user to understand that something is happening not being aggressive. The context of use will help you understanding the size to use. | Size | Description | | ---- | ----- | | Small | 10px | | Default | 16px | | Medium | 32px | | Large | 64px | Variations Positive Negative ","srcFilePath":"src/pages/docs/patterns/loading_indicator.md","id":"loading_indicator","location":"/docs/patterns/loading_indicator.html","url":"/docs/patterns/loading_indicator.html"},"modals":{"title":"Modals","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/modals.html","description":"A modal is a secondary window that communicates or provides an action inside the same process.","layout":"guide","weight":1,"content":" {$page.description} Usage Modals can be build in different sizes and configurations. Depending on the amount of content you have you will decide one of them. Lexicon recommends to not use full-width size as it will be like a complete new page. If you are in this situation please consider creating a new page instead of a modal. Modals belong to a screen, therefore a modal should not be triggered from another modal window (read below Modal over modal). When a modal has footer, the actions are placed inside and aligned to the left. There is an order of importance and the sequence is: Primary button (only one), secondary button, and button link. Do's Don'ts Use it to capture the user attention to something that is more important. Do not use it for complex cases where you need to display a lot of information or complete a long form. In this case thing about using a new page. Use it for simple content cases. Try not triggering a modal window from another modal window. Modal windows are subordinated to pages. Use it if you need to cut the user flow to display concrete and certain information, or if you need to capture certain data from the user. Do never blind completely the background page information. Selection inside a modal Multiple selection is done using checkboxes and clicking in \"Done\" labeled button. Single selection is done without radios, just clicking anywhere in the row. There is not need of modal footer. Modal over modal Modal over modal is a not desired situation. Please, try to solve this situation in another way, like using a full page or driving the process to the correct place. In case this happens, make sure to provide a good experience preventing first modal closing by accidental interaction (as an example). Size Modals are always displayed at the center of the screen and can be configured in 4 different size and they are defined as table shows: | Size | Description | | ---- | ----- | | Small | 320px | | Default | 600px | | Large | 896px wide modal in window sizes greater than 992px. 600px wide modal in window sizes between 768px and 992px. | | Full width | A modal that stretches to fit the browser window with 45px padding on every side. | Attributes Modal header Title Close button Body Content: form, text, image... Footer Modal buttons Configurations Lexicon allows your modal window to have different configurations related to your needs. These needs vary from case to case and that is why not every modal in the system needs to be equal, but needs to follow certain rules. Header, body and footer This is the classic composition of a modal window with its three main parts: header, body and footer. Header and body This is the case when you don't need a footer bar to place your icons. Body and Footer This case is thought for those cases where you need to just show text and buttons to agree or cancel. iFrame in the body It is always possible to bring an iFrame inside the body. For more information about this check Clay. Modal overlay color Modal overlay color is main lighten 8% color with an alpha value of 0.8. Modals for status messages Modal headers can be configured to use modals as status messages. This solution is proposed to give more emphasis on blocking actions that the use must read and pay careful attention. Do never remove the icon in the title as it provides the modal with a better accessibility level. Use direct and concrete titles. Mobile When a modal reaches the mobile viewport size its look and feel is transformed to the one you see below offering a mobile friendly version. Modal occupies the hole screen allowing only the interaction with the modal and its content. ","srcFilePath":"src/pages/docs/patterns/modals.md","id":"modals","location":"/docs/patterns/modals.html","url":"/docs/patterns/modals.html"},"pager":{"title":"Pager","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/pagination.html","description":"Pager allows navigation between pages of a process or task divided in subtasks or also called pages.","layout":"guide","weight":1,"hidden":"yes","content":" {$page.description} Usage Pagers are commonly used in forms that are chucked because of their length. Variations Default pager Use it when you need a simple pagination pattern that does not require to change the page size. Aligned pager Aligned pager pushes the links to the left and right. States States are important in pagers to let your users understand where the process has its limits and where it can go. Please take are of enabling and disabling them properly depending on the sequence. Sizes Usage each size depending on the context, take into account the available space and the hierarchical importance. | Size | Description | | ---- | ----------- | | Small | The font-size is 12px and the proportions are smaller. | | Default | The font-size is 16px and the proportions are smaller. | | Large | The font-size is 18px and the proportions are bigger. | ","srcFilePath":"src/pages/docs/patterns/pager.md","id":"pager","location":"/docs/patterns/pager.html","url":"/docs/patterns/pager.html"},"pagination":{"title":"Pagination","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/pagination.html","description":"Pagination allows horizontal navigation between chunks, also denominated pages, of a dataset.","layout":"guide","weight":1,"content":" {$page.description} Variations Pagination Use it when you need a simple pagination pattern that does not require to change the page size. Pagination includes several mechanisms to move between pages: Left arrow: Navigates backward 1 page. Disabled when the first page is selected. Numbers: redirects directly to a certain dataset chunk calculated with the page size. Ellipsis: It appears when the number of pages exceeds 6. It shows a dropdown menu with the rest of the pages. It is always shown in a middle position. Right arrow: Navigates forward 1 page. Disabled when the last page is selected. Pagination bar A pagination bar is pagination with additional functionality. This added functionality comes with a page size select placed on the left side of the bar. To the right side we incorporate a label to provide feedback on the exact chunk of information displayed from the dataset. On the right side of the pagination bar there is the classic pagination that adapts depending on the number of pages. Use it when you need a complex pagination pattern that requires changing the page size and re-calculating the number of pages. This pattern gives feedback about the chunk of dataset you are viewing. Description: Entries dropdown: to select the number of elements per page. You can configure you page size options. Descriptive text to clarify the dataset segment shown. Back arrow Selected page Non-selected page Ellipsis: to select intermediate pages through a dropdown menu. These pages are not possible to see due to the number of pages. Forth arrow Pagination bar mobile ","srcFilePath":"src/pages/docs/patterns/pagination.md","id":"pagination","location":"/docs/patterns/pagination.html","url":"/docs/patterns/pagination.html"},"popovers_tooltips":{"title":"Popovers and Tooltips","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/popovers.html","description":"Popovers and Tooltips are patterns used to show helpul information in two different ways.","layout":"guide","weight":1,"content":" {$page.description} Popovers Usage Popovers are used together with the question mark icon as an affordance to let the user understand there is something to read that can be useful. Popovers contain information such as help to understand a context. Do's and Don'ts Keep a distance of 8px between a text and the icon so it is easy to recognize and associate. Do Don't Similar to the previous case happens with sections, in this case the distance is 16px. Do Don't Attributes Tooltips Tooltips are brief pieces of information that appear on hover state over an element to clarify the meaning or use of an interaction element for the user. Usage Tooltips are used with icon buttons to help understanding the metaphor they transmit. They can be also used with links or images. Tooltips are thought to contain few text. Lexicon recommends a maximum of 280 characters. In case your description is longer, please use a popover. The tooltip appears on hover state and disappears when hover ends. This pattern does not exist in mobile a hover is not a possible state. Please make a right use of the arrow positioning as it could drive to misunderstandings when it doesn’t point to the correct interface element. When possible, try to not overlap other interaction elements in the same component. Do's and Don'ts Use tooltips on elements that have an action behind as button icons. Do Don't Attributes ","srcFilePath":"src/pages/docs/patterns/popovers_tooltips.md","id":"popovers_tooltips","location":"/docs/patterns/popovers_tooltips.html","url":"/docs/patterns/popovers_tooltips.html"},"progress_bars":{"title":"Progress Bar","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/progress_bars.html","description":"Progress bar is an evolution indicator used to show the completion percentage of a task.","layout":"guide","weight":1,"content":" {$page.description} Usage Progress bar are used as a feedback mechanism for system tasks. As long as the process is running the progress bar grows continuously from 0% to 100%. Use it for system processes. States Loading The bar progress grows in primary color and the label changes with the completion percentage. Warning Something happened and interrupted the process. Finished The process is completed successfully changing the label to success icon. Do's and Don'ts Do's Don'ts Use it in cases like a file upload or a process execution. Do never use it to identify the progress of a user in a certain set of actions. For that you need a multi step form type. ","srcFilePath":"src/pages/docs/patterns/progress_bars.md","id":"progress_bars","location":"/docs/patterns/progress_bars.html","url":"/docs/patterns/progress_bars.html"},"stickers":{"title":"Stickers","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/stickers.html","description":"The sticker is a visual element used to quickly identify content in a different way than badges and labels.","layout":"guide","weight":1,"content":" {$page.description} Usage Use stickers to visually identify elements in a dataset that are part of a same group. You can use any color you want for stickers. Sizes 24px Use it in smaller contexts where you only need visual identification but not manual interaction with this element. 32px Use it in cards that are image based, allowing to see more parts of the image. 40px Use it in sites to identify the user in a comment in comments portlet. Only rounded. 48px Use it in sites to identify the user in a blog entry or article. Only rounded. Colors Stickers can have any possible color. There default color for stickers is: Main Lighten 28% desat 5%, that corresponds to 6B6C7E Variations Square Use it only with files and folders. You can place up to 3 characters inside it or an icon. Always capital letters. Round Use it only with people. You can places up to 2 characters inside it or an image. Always capital letters. Position A sticker can be placed in a Image Card. Its position is always bottom left as you can see in the following example. ","srcFilePath":"src/pages/docs/patterns/stickers.md","id":"stickers","location":"/docs/patterns/stickers.html","url":"/docs/patterns/stickers.html"},"tabs":{"title":"Tabs","description":"Tabs are used to distribute content of a same nature in the same page without providing navigation.","layout":"guide","content":" {$page.description} Usage Use tabs when you need to move between views on the same context. Split your information into groups that are easy to identify by your end users. Order your tabs in a natural way for your users. Tabs are meant to be used when you don’t need to compare contents. All tabs in a tab bar must follow the same style and type. Changing styles in tabs can produce the feeling of navigation and this is not the desired outcome for this pattern. A tab must change to selected state on user selection. It must be easy to identify among other tabs. There can only be one tab selected at same time. The rest of the tabs must be possible to read. Tab label must be short, maximum two words, clear and concise. Do not use all caps in the label, this complicates the readability of the tab. One of the tabs must be always pre selected Tabs must collapse below \"More\" tab when the don't fit in the screen. More dropdown tab can exist if the tabs fit in the available width. This tab will be always the last one. Variations Classic tab Use this tab type inside forms. Modern tab Use this tab type together with dataset visualizations as the list view or card view. ","srcFilePath":"src/pages/docs/patterns/tabs.md","id":"tabs","location":"/docs/patterns/tabs.html","url":"/docs/patterns/tabs.html"},"timelines":{"title":"Timelines WIP","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/timelines.html","description":"Timelines represent an horizontal visualization of events along the time.","layout":"guide","weight":1,"hidden":"yes","content":" {$page.description} Usage Timelines are series of events placed in a timeline. Each event is composed by a point placed in the line a panel to describe the event to the right or left of the point. The point can be any kind of identifier. We recommend the default one, circle, but it can be the case of events related to people where you might prefer to use a user identifier. Variations Default The icons are aligned to the left side of the screen. Right timeline The icons are aligned to the right side of the screen. Center timeline The icons are aligned to the center of the screen. Even/odd timeline Being in the center the panel can appear in alternate positions starting on the left side for even configuration and starting on the right for odd configuration. Timeline Even Timeline Odd Right XS Timeline only On window resize to mobile viewport (","srcFilePath":"src/pages/docs/patterns/timelines.md","id":"timelines","location":"/docs/patterns/timelines.html","url":"/docs/patterns/timelines.html"},"Charts":{"children":{"chart-bar":{"title":"Bar chart","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/charts/basic/bar_chart.html","description":"A graphical data representation based on rectangle bars with proportional lengths and heights.","layout":"guide","weight":3,"content":" {$page.description} Color use Colors can be used in different ways in a bar chart, but Lexicon mainly contemplates two situations. Situation 1: Non-grouped data When data is not grouped all bars in the chart must have the same color. The reason behind this is that color is another dimension of information not needed here. In this case as there is only one color, no legend is needed. Situation 2: Grouped data Grouping data introduces an extra complexity level to the chart so colors are needed to add this extra dimension. All groups must have the bars in the same order. So it is easy to map the progression of a single item. In this case, as there are many colors, the legend is needed. States for non-grouped bar chart Single bar interaction States for grouped bar chart Different hover/focus states depending on the interaction chart element. Single bar interaction Legened item interaction Axis legend interaction ","srcFilePath":"src/pages/docs/patterns/Charts/chart-bar.md","id":"chart-bar","location":"/docs/patterns/Charts/chart-bar.html","url":"/docs/patterns/Charts/chart-bar.html"},"chart-color-palette":{"title":"Colors","description":"An specific color palette with the aim to provide the best charts user experience.","layout":"guide","weight":2,"content":" {$page.description} Colors must be the last choice you make to differentiate elements. Lexicon provides a specific color order, combinations and rules to follow when you create a new chart component, including patterns, dash lines and shapes. Flat Colors Gradient Colors This type of colors are available for those cases you don’t need a chart with embedded texts but a good visual differences between shapes (an example could be a Heat Map). Use of Gradient Colors A use example could be a low/high level Map with different data for every country with a maximum of 9 levels of differentiation. Rules for Gradient Colors You can get the same percentages we applied to the “Stark” blue for each one of the Flat Colors using a sass color generator, just paste the Flat Color HEX and you’ll get the percentages. This will provide you with a set of colors that you can use as gradient colors. Reading colors Colors are used to provide data identification and improve legibility for some users. But colors have to be carefully used to not fall in the opposite result. Shape & order Using the correct shape and colors order helps to avoid color vibration and identify the different chart sections even for color blind users. This is an example using a Pie: Do Don't Lines Charts For line charts use only borders, 2px thickness, and differentiate them using dash types, shape types and colors. Don’t use background/area colors with line charts, it will only confuse the user. Area Charts In the case of Area Charts it could be necessary to add a background to the area, that’s why we recommend to use 10% opacity for each flat color as the background of its area. This will allow the area to adapt when mixed to another one. Use the same elements as Line Charts for borders and shapes. Colors on chart interaction For a better understanding let the user interact with the data and Focus on single elements. In this example we used a resize on the selected element (from the pie or the legend) and an opacity of 40% in the others to highlight it: Here’s another example using a Line chart, in this case what we have done is to keep the hover element with a 2px border and set the other elements to a 1px border and 40% opacity: Text embedded in area Though it is possible to include texts inside the Flat Colors as default, we don’t recommend it. It is preferable to use other components to improve the text readability, organization and interaction. A good place is usally the legend. Accessibility Lexicon wants to offer you a possibility to make your charts more accessible in case you need this option. Therefore, we have created a series of complements for your charts to improve their accessibility. Lines and Shapes Lines and shapes can help you to establish patterns in line charts. This example shows you both elements in action. Area pattern Area pattern helps identifying better areas due to the shapes each section has plotted. Lexicon provides 9 patterns for areas show below. This patterns are thought to be used only when areas don't overlap, as in a pie chart. ","srcFilePath":"src/pages/docs/patterns/Charts/chart-color-palette.md","id":"chart-color-palette","location":"/docs/patterns/Charts/chart-color-palette.html","url":"/docs/patterns/Charts/chart-color-palette.html"},"chart-doughnut":{"title":"Doughnut chart","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/charts/basic/donut_chart.html","description":"Doughnut chart is a variation of the Pie chart that allows to divide data by numerical proportions of a total value.","layout":"guide","weight":3,"content":" {$page.description} We recommend you to use the Doughnut chart instead of the Pie chart due to: When you first see the Pie Chart the eyes tend to be attracted to the center of the pie, then to the outside circle, and only after that the different parts of the chart. When you first see the Doughnut Chart there’s no center to be attracted to and the eyes can read the different parts of the chart easily. Color use The Doughtnut Chart must follow the same color order defined for charts starting from the first element in the right-top position. States Chart item interaction ","srcFilePath":"src/pages/docs/patterns/Charts/chart-doughnut.md","id":"chart-doughnut","location":"/docs/patterns/Charts/chart-doughnut.html","url":"/docs/patterns/Charts/chart-doughnut.html"},"chart-heatmap":{"title":"Heatmap chart","titleLabel":"Pending","description":"The Heatmap chart is a visual representation of the data using colors to indicate the level of the values.","layout":"guide","weight":3,"content":" {$page.description} Color use Lexicon currently provides a serie of color sets to help the design of the Experience Cloud analytics, in the case of the heatmap you must use a single color value and white for the time-spots. Shapes use To help reading the activity you can use up to 7 different circle items (bubbles) inside the chart: 0, 4, 8, 12, 16, 24, 32. States Single item interaction X-axis item interaction Y-axis item interaction Legend item interaction ","srcFilePath":"src/pages/docs/patterns/Charts/chart-heatmap.md","id":"chart-heatmap","location":"/docs/patterns/Charts/chart-heatmap.html","url":"/docs/patterns/Charts/chart-heatmap.html"},"chart-interaction":{"title":"Interaction","description":"A description of the basic intection behaviors for all charts so the user always know what to expect.","layout":"guide","weight":2,"content":" {$page.description} Interaction events In case you need to create your own chart, it is really valuable to know how our events are defined. Use the same rules to be consistent with the rest of charts. Mouse events Mouse hover Show popover Mouse out Dismiss popover Mouse click If element is not selected Selects the element. This is a gray-out, 40% opacity, of the rest. Show popover If element is selected (the click can be in the element itself or any other part of the chart, except the popover) Unselects the element Dismiss popover Chart to default state Touch events Same as mouse click events. Interaction items Chart item This can be a bar inside a bar chart, a pie-piece in a pie chart, etc. The popover must show information related to this specific item. The popover must be shown on top of the chart item. Highlight legend item (font weight to semibold). This creates a better relation between element in chart a legend value. Chart item inside a group We are not going to make a difference between grouped items and stand alone items. Whenever there is an interaction inside a set of items we will do individual interactions per item as in Chart Item. Axis item The popover must show information related to all the elements in that axis row or column. This information can be either a global information, like a number, or an information breakdown. The popover must be shown next to the axis item not hovering the chart. Sometimes there will be only one axis. Sometimes the chart will not provide interaction in both axis. This is perfectly normal. Example: Vertical stacked bar An interaction in the x-axis item will show a popover with information for each of the items. An interaction in the y-axis item will show nothing. Legend item Highlight all items of this legend type in the chart. The popover must show information related to this specific item summary information for that legend type. The popover must be shown on top of the legend item. Chart popover Chart popover allow you to display specific data for a exact point or exact area that is interactive. This is just a different usage of the popover pattern. The following half donut chart shows a chart tooltip in action. ","srcFilePath":"src/pages/docs/patterns/Charts/chart-interaction.md","id":"chart-interaction","location":"/docs/patterns/Charts/chart-interaction.html","url":"/docs/patterns/Charts/chart-interaction.html"},"chart-line":{"title":"Line chart","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/charts/basic/bar_chart.html","description":"A type of chart which displays information as a series of data points connected by straight line segments.","layout":"guide","weight":3,"content":" {$page.description} The measurement points are ordered (typically by their x-axis value) and joined with straight line segments. A line chart is often used to visualize a trend in data over intervals of time – a time series – thus the line is often drawn chronologically. Line charts can also be used to compare changes over the same period of time for more than one group. Color use In the case of Line Chart you must follow the same color order defined for charts. Each graph will have one different color,but different line types and shapes for markers so as to easily differentiate each of them. Pattern use Patterns, both line type and shape type, are of free use. They provide a better accessibility for your disabled users. But it is up to you to decide when to use them. States Chart item interaction Legened item interaction ","srcFilePath":"src/pages/docs/patterns/Charts/chart-line.md","id":"chart-line","location":"/docs/patterns/Charts/chart-line.html","url":"/docs/patterns/Charts/chart-line.html"},"chart-pie":{"title":"Pie chart","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/charts/basic/pie_chart.html","description":"Pie chart allows to divide data by numerical proportions of a total value (always 100%).","layout":"guide","weight":3,"content":" {$page.description} Color use The Pie Chart must follow the same color order defined for charts starting from the first element in the right-top position. States Chart item interaction ","srcFilePath":"src/pages/docs/patterns/Charts/chart-pie.md","id":"chart-pie","location":"/docs/patterns/Charts/chart-pie.html","url":"/docs/patterns/Charts/chart-pie.html"},"chart-stacked-bar":{"title":"Stacked bar chart","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/charts/basic/bar_chart.html","description":"Stacked Bar chart allows to compare the values of single items with the total data value.","layout":"guide","weight":3,"content":" {$page.description} Stacked bar charts can be either plotted in vertical or horizontal. In this page, we focus on vertical bars but both possibilities are allowed. This chart type is implemented using bar charts. Color use On the stacked bar you must follow the same color order defined for charts, starting from left to right in horizontal bars and from bottom to top in vertical bars States Single bar item interaction Legened item interaction Axis legend interaction ","srcFilePath":"src/pages/docs/patterns/Charts/chart-stacked-bar.md","id":"chart-stacked-bar","location":"/docs/patterns/Charts/chart-stacked-bar.html","url":"/docs/patterns/Charts/chart-stacked-bar.html"},"charts":{"title":"Charts","description":"This section define and describes Lexicon Charts as a main graphical pattern to analyze data.","layout":"guide","weight":1,"content":" {$page.description} Color Colors must be the last choice you make to differentiate elements. Lexicon provides a specific color order, combinations and rules to follow when you create a new chart component, including patterns, dash lines and shapes. Interaction Lexicon states a series of basic behaviors for all its charts so the user always know what to expect. This behaviors reinforce consistancy and reduces the learning curve. Collection This collection of charts grow with Liferay products' necesities. So come back every now and then or review our news to be updated. Bar Chart Doughnut Chart Heatmap Chart Line Chart Pie Chart Stacked Bar Chart ","srcFilePath":"src/pages/docs/patterns/Charts/charts.md","id":"charts","location":"/docs/patterns/Charts/charts.html","url":"/docs/patterns/Charts/charts.html"}},"title":"Charts","description":"Charts section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Charts/index.md","id":"Charts","location":"/docs/patterns/Charts/","url":"/docs/patterns/Charts/","childIds":["charts","chart-color-palette","chart-interaction","chart-bar","chart-doughnut","chart-heatmap","chart-line","chart-pie","chart-stacked-bar"]},"Forms":{"children":{"forms":{"title":"Forms","description":"Forms obtain user data and transmits it to the system either to store, produce an action, or both.","layout":"guide","weight":1,"content":" {$page.description} Parts Title. Required Description. Not required but very useful. It should describe the form usage. Form Elements: Text input. For more information visit Text Input. Text input localizable. For more information visit Text Input Localizable. Selector. For more information visit Selectors. Radio. Visit Checkbox, Radio and Toggle for more information Checkbox. Visit Checkbox, Radio and Toggle for more information. Section. Sections are identified with primary text with font-size of 14px and always in capital letters. Some forms may require a full width underline for a better visual separation of content. This is usually used in configuration forms. Buttons. Visit Actions to understand the use of buttons in forms. Layout Forms can be created in one single column or two columns. If your form is divided in several sections that are stacked consider not changing the internal layout between sections, it can affect the experience of filling the whole form. When applying columns take into account that the reading direction is left-right, and up-down, in each column. So expect your user to read first column one and then column two. One single form Two columns form Attributes Spacing Respecting the distancies between form elements such as texts, fields, sections, etc, is very important. Please take a closer look to our hierarchy page to understand it. As a general thumb rule apply the following sizes for distances: | Description | Desktop | Mobile | | --- | --- | --- | | Form padding | 24px | 16px | | Horizontal | | | | - Between consecutive components | 16px | 16px | | - Between non-consecutive components | 24px | 24px | | Vertical | | | | - Between consecutive components: title, fields, section... | 24px | 16px | | - Between form title or title + description for next component | 48px | 32px | Title Sections First level sections can be either collapsible or not. On the other hand, second level sections are never collasible. Form section titles might be long and the layout must prevent it. Paragraph ","srcFilePath":"src/pages/docs/patterns/Forms/forms.md","id":"forms","location":"/docs/patterns/Forms/forms.html","url":"/docs/patterns/Forms/forms.html"},"formsHierarchy":{"title":"Forms Hierarchy","description":"Definition of the content hierarchy inside a form structure and the components used to identify it.","layout":"guide","weight":2,"content":" {$page.description} This page contemplates the visual definition of the hierarchy, the measurements and the definition of the components that establish that hierarchy Layout There are defined three main elements to define the form hierarchy: Form title First level section header. This one can be either: The header of a fixed section The header of a collapsible section Second level section header You can see all these elements coexisting in the same form structure in the following examples: Including examplanatory texts: Attributes Metrics definition is important to understand how forms are build and the vertical spacing logic work in our forms. Desktop As it’s explained in the grid section, the main vertical spacing reference is 24px. Section blocks metrics Inside sections metrics Metrics using explanatory texts associated to different section levels Mobile In small viewports, as it’s explained in the grid section the main vertical spacing reference changes from 24px to 16px. ","srcFilePath":"src/pages/docs/patterns/Forms/formsHierarchy.md","id":"formsHierarchy","location":"/docs/patterns/Forms/formsHierarchy.html","url":"/docs/patterns/Forms/formsHierarchy.html"},"formsNavigation":{"title":"Forms Navigation","description":"Forms can have navigation and this can appear in two different ways: left navigation menu or wizard.","layout":"guide","weight":2,"content":" {$page.description} Left navigation menu A left navigation menu allow us to break down the complexity of a form into many and more simple forms. A good rule to divide forms is context. When using a left navigation menu, it is pretty important to identify the form title with the same name the menu item has. Wizards Forms can be used together with wizards, so called Multi step forms. Wizards allow us to break down the form complexity into a process of smaller consecutive forms where the user can focus more its attention and that we want the user to go through. There are 2 types of wizards: Multi Step Form. Or Wizard form is used to divide the main tasks of a form in subtasks so as not to have so many information and provide a progressing completion. See more about Multi Steps Forms Multi Step form Simplified is used as a progressive disclosure method to let the user know where he/she is. Example of Multi Step form used in a Modal. Visit Multi Step Form Simplified to have more information. ","srcFilePath":"src/pages/docs/patterns/Forms/formsNavigation.md","id":"formsNavigation","location":"/docs/patterns/Forms/formsNavigation.html","url":"/docs/patterns/Forms/formsNavigation.html"},"formsRules":{"title":"Forms Rules","description":"Set of rules and recommendations to know how form patterns must be placed in portal.","layout":"guide","weight":2,"content":" {$page.description} Fields’ order Laying out the fields of your form we recommend you to follow an order of importance. Try to place first as many mandatory fields when possible to make the user task short. Non mandatory fields should go in a second place as they are not so important and the user could like to skip them. In case non mandatory fields are in between mandatory fields the user would expend more time scanning the form. Fields’ length Fields must occupy the space you expect your user needs to fill it. The only requirement for fields is to adapt their width to the grid so they behave properly on window resize. Sharp shape forms do not go against Lexicon but we prefer rectangular shape form as they look more clear. In mobile view ports field lengths should be half of the screen or full length. Mandatory fields Fields can be mandatory/required to fill in a form. The way to mark a field as mandatory is: Try to place first as many mandatory fields when possible to make the user task short. Non mandatory fields should go in a second place as they are not so important and the user may like to skip them. In case non mandatory fields are in between mandatory fields the user would expend more time scanning the form. Repeatable fields Single repeatable field Single repeable field is useful when the user must introduce several data of the same type from different inputs, no matter the number nor the order. Set of repeatable fields This allow you let the user add contents of a same type in a form. This is usually used to contribute with more form pieces that allow the user to specify more information. A set always bring the possibility to add or remove sets. See the following example: Actions General form actions General form actions always placed at the end of the form and they are always placed in same order and to the left of the form. The button size to use is default. Note: This order is reversed in modals, where buttons in the footer are right-aligned: Link, Secondary, Primary. Interior form actions Interior form actions should not be as notorious as general actions. Therefore, use the secondary button. Do's and Don'ts Do never use two primary buttons together. There must only be one primary button that represents the most important action. Do Don't Do always use concrete words rather than general as \"Ok\". Do Don't Boolean situations Boolean situations are those yes/no situations usually solved with checkboxes. Try to be always as explicit as possible to let the user know what is the outcome of the decision. Do not hide helpful information to the user in popovers, alerts, or secondary text. ","srcFilePath":"src/pages/docs/patterns/Forms/formsRules.md","id":"formsRules","location":"/docs/patterns/Forms/formsRules.html","url":"/docs/patterns/Forms/formsRules.html"},"formsValidation":{"title":"Forms Validation","description":"A description of how validation patterns must be displayed within form structures.","layout":"guide","weight":2,"content":" {$page.description} Partial validation This type of validation is done even if the form is not complety full and without the need of submitting the form. Inline validation Forms have inline validation. All form fields that can be checked against a set of rules while filling them must show success or error state to the user. At least one field required It can be the case that inside a form or a fieldset only one of the input fields is required without a concrete decision on which of them must be required. In that case: Set mandatory mark in the fieldset title. It is recommended to include a short help text below the title. \"Please enter at least one of the following fields.\" All fields must be marked with the validation color as it corresponds. The only validation message is shown for just one (better the first) input in the fields group. A good help message allows the user identifying the error and how to solve it. Once the validation conditions are met, the alert message disappears. Losing focus triggers validation unless one field in the group field is focused. Full validation Forms are validated on submit action through the \"Save\" action. When a form is completely validated it will first do the partial validation of all mandatory fields. If this is successful, a service will be called. In this section we focus on the return of that service call, that we reflect as an alert embedded. ","srcFilePath":"src/pages/docs/patterns/Forms/formsValidation.md","id":"formsValidation","location":"/docs/patterns/Forms/formsValidation.html","url":"/docs/patterns/Forms/formsValidation.html"},"multiStepForm":{"title":"Multi Step Form","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/forms/multi_step_form.html","description":"A progress bar used to divide the main task in subtasks to help users completing long processes.","layout":"guide","weight":3,"content":" {$page.description} Usage Multi step form is meant to be used in those context where a major or big task has to be divided in smaller task with the aim of letting the user breath in the process and provide progressive completion feeling. Multi step form is most commonly used to guide the user in the process of filling a complex or a long form. Some processes may require you to navigate backwards through the process. For those cases make sure to set up links in the multi step form elements. Lexicon recommends 7 as a maximum number of steps to have for two reasons. First, because 7 is a good number of elements to remember. Second, because when reaching mobile screens is a good threshold for touch interaction. In case you need more than 7 steps they will be grouped under the 6th element in the multi step form with a dropdown menu. Each of the steps can have 3 different states: Disabled, selected or done. Use it when the task is long and/or complicated to divide it in small chunks easier to complete by the user. Use it when the user needs guidance in the process in a process that she is not familiar with. Use it when there is a specific sequence to complete steps. Make chunks that are not overwhelming. Step names must be clear, short, and express the content below them. Use two words maximum. A multi step form must have a minimum of two steps: Lexicon recommends to use a maximum of seven steps: But in case you need to implement more steps to make the process easier to your user, please follow this recommendation: Example Attributes Done: Checked page Selected: Current page Disabled: Non visited page Steps row: equally divided space between all steps. Mobile Due to the reduce space in mobile the process bar is reduced to a maximum of 5 steps. The steps overflow is always placed under the second to last step: Example ","srcFilePath":"src/pages/docs/patterns/Forms/multiStepForm.md","id":"multiStepForm","location":"/docs/patterns/Forms/multiStepForm.html","url":"/docs/patterns/Forms/multiStepForm.html"},"multiStepFormSimplified":{"title":"Multi Step Form Simplified","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/forms/multi_step_form_simplified.html","description":"A progressive disclosure method to guide the user through a task divided in several steps.","layout":"guide","weight":3,"content":" {$page.description} Usage Multi step form simplified is thought to be used in those context where the multi step form is very heavy in visual terms and it catches more attention than needed: This simplified version is not interactive and only informative. Its most common context of use is inside modals that have a process with several steps. The left side is reserved for the step name. The right side is reserved for the step number that must always indicate the current step number of a total of steps. Attributes Step title Step counter reference Example of use ","srcFilePath":"src/pages/docs/patterns/Forms/multiStepFormSimplified.md","id":"multiStepFormSimplified","location":"/docs/patterns/Forms/multiStepFormSimplified.html","url":"/docs/patterns/Forms/multiStepFormSimplified.html"},"radio_check_toggle":{"title":"Checkbox, Radio, Toggle","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/forms/form_custom.html","description":"Checkboxes, radios and toggles provide users with different selection and activation tools.","layout":"guide","weight":3,"content":" {$page.description} Checkbox A checkbox is a component that allows the user selecting something written in its associated text label. A list of consecutive checkboxes would allow the user to select multiple things.\" Note: although we have visually defined the checkbox, we use the native checkbox as it is easier to identify by the end user using different web browsers. States | State | Definition | | ----- | ---------- | | | On | | | Off | | | On disabled | | | Off disabled | | | Checkbox Variable for multiple selection | Checkbox group On of the most common ways to find checkboxes in a form is grouped offering a set of options. Do's and Don'ts Use capital letters in text associated to a checkbox. Do Don't Use checkboxes for multiple choices in a set of options. Do Don't Use checkboxes when more than one option can be selected. Do Don't Radio A radio is a component that allows the user selecting something written in its associated text label. A list of consecutive radio would allow the user to select just one thing. Note: although we have visually defined the radio, we use the native radio as it is easier to identify by the end user using different web browsers. States | State | Definition | | ----- | ---------- | | | On | | | Off | | | On disabled | | | Off disabled | Radio Group On of the most common ways to find checkboxes in a form is grouped offering a set of options. It is very common to have the need of spliting a long list of options in several columns to reduce space. How to decide can be difficult: 1 column: It is always easier and faster to read as the eye doesn’t have to jump. Use it always when you have long descriptions. Splitting in many columns: Make sure to have really many options and to have at least 6 elements per column, otherwise there is no real benefit. Radio vs Dropdown Menu It is a common case of doubt when to use radios or a dropdown menu instead when users need to choose one item out of a list of options. There is not a fixed rule for that but we propose this guidelines. Radio buttons: When the number of options is small When options need a long label to explain the differences of each option. Radio buttons are always listed vertically. Dropdown menus: When the number of options is large, or has the potential to become large. Options should be of the same nature (e.g. a list of branches, or a list of people). Do's and Don'ts Use capital letters in text associated to a radio. Do Don't Use radio when only one option can be selected. Do Don't Toggle A toggle is an interface element that by its activation or deactivation provokes an immediate action in the screen. States A switch can be in one of these four different status: | State | Definition | | ----- | ---------- | | | On | | | Off | | | On disabled | | | Off disabled | Do's and Don'ts Use capital letters in text associated to a toogle. Do Don't Use toogles for activation. Do Don't Use checkboxes instead of toggles in confirmation messages. Do Don't Variations Toggle with data attributes This type of toggles have labels around as the title label or other support label that make more explicit the switch value. The support label can be either at the top, right, bottom or left and its value should change with the toggle state change as the example shows. All the labels have the interaction that the switch have making the toggle more accessible. Toggle with icon Toggles can also have an icon inside the toggle circle that helps to identify the action. A toggles with icon can also have data attributes as the previous variation. ","srcFilePath":"src/pages/docs/patterns/Forms/radio_check_toggle.md","id":"radio_check_toggle","location":"/docs/patterns/Forms/radio_check_toggle.html","url":"/docs/patterns/Forms/radio_check_toggle.html"},"selector":{"title":"Selectors","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/forms/form_elements.html#select-element","description":"A form control element used to select and entry data within several provided options.","layout":"guide","weight":3,"content":" {$page.description} Usage This pattern is completely different from a dropdown as a select is a native component with a data provider. A dropdown, instead, opens a panel where the panel could contain multiple and different nature elements. States The states for a select are the same as for a text input. ","srcFilePath":"src/pages/docs/patterns/Forms/selector.md","id":"selector","location":"/docs/patterns/Forms/selector.html","url":"/docs/patterns/Forms/selector.html"},"slider":{"title":"Slider","titleLabel":"Pending","description":"The Slider control allows user to select and entry data from among a linear range of values.","layout":"guide","weight":3,"content":" {$page.description} Usage Slider are used in those contexts where we want to select a value in a range where we want the user to play with the possible values. A typical usage is selecting the contrast color value for an image. States Active Disabled Variations Slider This is the simple slider variation where no labels are given but other reference means could be around it. For example, the outcome value could be perceived over an associated image. Example: Color contrast slider for an image. Slider with label This variation allows to have a reference label where the slider head feedback is provided in text. This slider type is used where the range of values is easy to understand. Example: Color opacity range is always 0-100. Slider with references Slider with references is used when the range references are not commonly known. ","srcFilePath":"src/pages/docs/patterns/Forms/slider.md","id":"slider","location":"/docs/patterns/Forms/slider.html","url":"/docs/patterns/Forms/slider.html"},"text_input":{"title":"Text Input","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/forms/form_elements.html","description":"A description of the different text input types, including usage and validation states.","layout":"guide","weight":4,"content":" {$page.description} Text Field A text field allow users write data in the system with the end of this data to be processed. Usage Text fields can have help text. Lexicon provides 2 different mechanisms to provide help: Help text below the field: Use it if you want your help text to be very explicit. Help text inside a popover triggered from a help icon next to the title: Use it in case your help text doesn't really need to be explicit. Placeholder is not recommended as users interpret it as final text. In case you use it, do not write help text on it, just a text example. States Default Text fields can be as simple as: They can include a placeholder text, although we do not recommend using placeholders as users interpret them as final content. Text fields can also have a help text placed right below the text field. Active Disabled Read only Validations Validation text for fields are placed right below the field box and before the help text focusing the attention of the user right next to the issue. Success Warning Error Attributes A textfield has at least the following elements: Label Text field box Placeholder Status message Help text Text area A text area is similar to a text field input but for several lines of text. Text areas allow users to introduce long description of products as an example. Usage Text area can be resized in height allowing the user to see more or less text as he please. Text area states and validation states are the same as for the text field. Text areas can have help text. Lexicon provides 2 different mechanisms to provide help: Help text below the field: Use it if you want your help text to be very explicit. Help text inside a popover triggered from a help icon next to the title: Use it in case your help text doesn't really need to be explicit. Placeholder is not recommended. In case you use it, do not write help text on it, just a text example. Text area can be configured to expand on input change. The min-height to configure is 44px as the text field. The text area has a mid-height value set to 88px, equivalent to 3 lines of text. The text area has a max-height value set to 200px. From mid-height to max-height the text area will grows in height. When it reaches that maximum the text area stops growing and vertical scroll bar becomes available. A recommendation is to configure the min-height with the same value as mid-height as 3 lines is the recommendation for a text size. ","srcFilePath":"src/pages/docs/patterns/Forms/text_input.md","id":"text_input","location":"/docs/patterns/Forms/text_input.html","url":"/docs/patterns/Forms/text_input.html"},"text_input_group":{"title":"Text Input Group","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/forms/form_elements_input_groups.html","description":"A text field with added elements that configure a more complex input structure.","layout":"guide","weight":4,"content":" {$page.description} Layout The layout of an input has a bit of freedom. You are allowed to configure elements on the left or the right side of the field or both at same time. Usually the components placed around the textfield are buttons, split button and/or help labels. These help labels are placed to make more explicit things as currency, unit of measurement, digits, email addresses, etc. Types Input group with button Url input group Input group with units Input group with radio or checkbox ","srcFilePath":"src/pages/docs/patterns/Forms/text_input_group.md","id":"text_input_group","location":"/docs/patterns/Forms/text_input_group.html","url":"/docs/patterns/Forms/text_input_group.html"},"text_input_localizable":{"title":"Text Input Localizable","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/forms/form_elements_input_groups.html#input-group-mixed","description":"A text input viaration used in those fields that can be translated into multiple languages.","layout":"guide","weight":4,"content":" {$page.description} Layout This component is composed by two elements: The input field: text input, text area or text input group (only specific cases). The localization button, which displays a dropdown menu to select a language. This dropdown menu must always contain in each entry: Country flag ISO 639-1 code Status: Default for the default language. Always the first in the list Translated: the user has provided a text that differs from the default input text. Not translated: the input text does not differ from the original text. Interaction Changing a language through the localization button only changes field content, not the title label, and the help text. The help text is used to display the default language text to provide a hint to the user. Usually this field is placed in a form where other fields are also localizable. The interaction of selecting a lenguage in one of the localizable fields changes all other fields language at same time. Attributes Input field Localizable button Variations Text area localizable Text input group localizable A very common case in Liferay Portal is to have translate fields for urls. This field is a clear combination of a input group with a localizable field. ","srcFilePath":"src/pages/docs/patterns/Forms/text_input_localizable.md","id":"text_input_localizable","location":"/docs/patterns/Forms/text_input_localizable.html","url":"/docs/patterns/Forms/text_input_localizable.html"},"text_input_variations":{"title":"Text Input Variations","description":"A description of the search, autocomplete, labels input, date, numeric and password input variations.","layout":"guide","weight":4,"content":" {$page.description} Autocomplete text field PENDING Autocomplete textfield is the input that has a data provider associated offering the user text suggestions while typing. Search field PENDING Search field is pretty similar to autocomplete text field but the field states are defined better to adapt to search scenario. Usage A search field can have auto completion showing a list of options below the field. The list below must be as wide as the search field. The list must update its content as the user types. Characters in each entry must be semibold and marked in regular as the user types. States Default Focus Active Labels Input Field PENDING Labels input field is specially focus on writing categories or tags. Date Field or Date Select PENDING Date select allows to select a date. This date select is similar to the one in HTML5 and includes same functionalities. Lexicon recommends to use native date selects as users are used to them. Use this one in desktop viewport. Numeric field PENDING Use numeric fields whenever you are going to use integer or float numbers. Numeric fields have the advantage to include mechanisms to increase and decrease the value by using arrow keys and inside field buttons. Password field PENDING Input password field is used in situations where the user needs to write a password. ","srcFilePath":"src/pages/docs/patterns/Forms/text_input_variations.md","id":"text_input_variations","location":"/docs/patterns/Forms/text_input_variations.html","url":"/docs/patterns/Forms/text_input_variations.html"}},"title":"Forms","description":"Patterns section","layout":"guide","icon":"lexicon-site-doc","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Forms/index.md","id":"Forms","location":"/docs/patterns/Forms/","url":"/docs/patterns/Forms/","childIds":["forms","formsHierarchy","formsNavigation","formsRules","formsValidation","radio_check_toggle","multiStepForm","multiStepFormSimplified","selector","slider","text_input","text_input_group","text_input_localizable","text_input_variations"]},"Navigation":{"children":{"breadcrumb":{"title":"Breadcrumb","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/navigation/breadcrumbs.html","description":"Breadcrumb is a secondary navigation pattern that identifies the page position inside a hierarchy.","layout":"guide","weight":2,"content":" {$page.description} Usage Breadcrumb works in the same way in for any kind of viewport size. When there is not enough space in the screen to make all the breadcrumbs explicit, first levels are collapsed in a dropdown allowing the user to read and navigate to the previous closer levels but also allowing to navigate to other levels in an easy way. The breadcrumb is always horizontal. Long crumbs can be reduced using ellipsis. All crumbs are links to the respective navigation level, except last crumb that is only used to identify the current page. When the crumbs reach overflow in the screen, the elements get collapsed into a dropdown menu as show below. The order of the elements inside the dropdown menu is reversed. Do's and Don'ts Do's Don'ts Only use it for hierarchical purposes. Do not use it if there is only one navigation level. Use it when navigating through folders in tables/lists. Do not use it in the first navigation level. Do not use it for cross application navigation. Never use more than one text line. Attributes ","srcFilePath":"src/pages/docs/patterns/Navigation/breadcrumb.md","id":"breadcrumb","location":"/docs/patterns/Navigation/breadcrumb.html","url":"/docs/patterns/Navigation/breadcrumb.html"},"header":{"title":"Header","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/header.html","description":"Header is toolbar that provides identification and allows the user to navigate and perform actions.","layout":"guide","weight":2,"content":" {$page.description} Usage Header is always fixed to the top of the window. This header is used in almost every page in the system. It can have different configurations as you can see in the following examples. But it has a common configuration: Left area: Used for actions as triggering the side menu and back navigation. Center area: Used for the page or application title and help. Right area: Used for actions, explicit when it is possible and a maximum number of 3. Implicit inside a kebab menu when the metaphor is not clear. These actions are application level actions. Examples Application header The application title appears always in the header, in this case Web Content. The title always remain there until a navigation to a detail page or asset is done. Related actions to the application might appear on the right side. Asset or element detail page header The asset or element title appears in the header. A back button is provided to navigate to the asset/element location in the application. Related actions to the asset/element might appear on the right side. Main page header on site site The page name is identified in the header. The related actions appear as 3 icons on the right side: configuration, add menu and simulation. Attributes Product menu button Back button Page or Application title Help icon to trigger help information Configuration Add menu button Simulation button ","srcFilePath":"src/pages/docs/patterns/Navigation/header.md","id":"header","location":"/docs/patterns/Navigation/header.html","url":"/docs/patterns/Navigation/header.html"},"horizontalNav":{"title":"Navbar","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/navigation/navbar.html","description":"A navigation bar displayed horizontally that provides access points to different parts of a system.","layout":"guide","weight":2,"content":" {$page.description} Usage Navbars in are used inside applications to provide navigation among their different application sections. A navbar is always horizontal and can contain one or several entry points placed from left to right. Place first the most important ones. When the number of tabs goes over the physical size of the navbar, the overflowing tabs get collapse into the last one. This tabs are accessible through a dropdown menu. Please see the following example: The user is interacting with the sixth tab where the dropdown menu is open and he is hovering an entry. The has selected the option Sixth in the dropdown menu. When the user opens the dropdown menu Sixth option appears marked as selected. Once a tab is selected outside the dropdown menu, the dropdown menu tab changes its label to \"More\" as default value. Variations Default Positive navigation bar is defined for Sites. Inverted Negative navigation bar is defined for Admin. It is always placed right below the header. ","srcFilePath":"src/pages/docs/patterns/Navigation/horizontalNav.md","id":"horizontalNav","location":"/docs/patterns/Navigation/horizontalNav.html","url":"/docs/patterns/Navigation/horizontalNav.html"},"navigation":{"title":"Navigation","description":"This section provides basic use guidelines related to the main navigation patterns of the system. ","layout":"guide","weight":1,"content":" {$page.description} This section describes the main navigational patterns, although it is necessary to point out that there are more patterns that could produce a navigation on interaction with them. Product navigation in DE is always done through the side nav. This navigation pattern is always placed to left side of the screen can be shown and hidden using the product menu icon. Page navigation can have different compositions but it always follows a same pattern: Header (mandatory): It shoes the application name Product menu button Page / Application name Application actions as Export/Import or Permissions Application sections: Use it only in case the application has more than one section. ","srcFilePath":"src/pages/docs/patterns/Navigation/navigation.md","id":"navigation","location":"/docs/patterns/Navigation/navigation.html","url":"/docs/patterns/Navigation/navigation.html"},"verticalNav":{"title":"Vertical Navigation","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/navigation/vertical_navigation.html","description":"An alternative pattern used for a vertical display of the sections of a navigation list.","layout":"guide","weight":2,"content":" {$page.description} Usage This pattern is always vertical and placed to the left of the form allowing the navigation between different pages/forms. Normally, this navigation pattern is used in lower navigation levels to reach the lowest level pages. This pattern is used in form templates. Remember Lexicon recommends to split long forms into smaller forms to make task easier. Therefore, this navigation pattern is needed to access the different forms. Mobile In mobile devices the navigation is translated into a full-width collapsible menu displayed right before the form. When this menu opens it never pushes down the content, it is displayed over the form. ","srcFilePath":"src/pages/docs/patterns/Navigation/verticalNav.md","id":"verticalNav","location":"/docs/patterns/Navigation/verticalNav.html","url":"/docs/patterns/Navigation/verticalNav.html"}},"title":"Navigation","description":"Navigation section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Navigation/index.md","id":"Navigation","location":"/docs/patterns/Navigation/","url":"/docs/patterns/Navigation/","childIds":["navigation","breadcrumb","header","horizontalNav","verticalNav"]},"Sites":{"children":{"assetTitleBar":{"title":"Asset Title Bar","description":"A bar used to display the title of an asset and its associated actions when specific ADTs are displayed.","layout":"guide","weight":2,"content":" {$page.description} Attributes Variations Profile info pattern can be defined in different ways as the application needs may vary. Blog entry example: Blog entry metrics: Example in Context Tools are shown when hovering anywhere in the asset. ","srcFilePath":"src/pages/docs/patterns/Sites/assetTitleBar.md","id":"assetTitleBar","location":"/docs/patterns/Sites/assetTitleBar.html","url":"/docs/patterns/Sites/assetTitleBar.html"},"assetToolbar":{"title":"Asset Toolbar","description":"A multi-purpose toolbar that can be located in different types of asset visualizations.","layout":"guide","weight":2,"content":" {$page.description} Layout It is important to reflect the flexibility of this toolbar type showcasing different examples of use. 8 columns Asset publisher asset Knowledge base article Blog entry Blog list item Comments Mobile viewport < 577 And its transformation when reaching mobile viewports: Asset publisher asset Knowledge base article Blog entry Blog list item Comments This toolbar can contain tools, links or informative elements. The toolbar is structured in two different groups of tools or informative elements. Most of the tools and content is organized in a group aligned left, and the social tools are organized in group that is aligned right. The “Share” button always has a dropdown menu associated where the data provider is a list of places/networks where to share. The list always contain the explicit social networks placed as icon buttons outside the list. Examples of use An example of use of this toolbar can be found in blogs, where in desktop in an 8 columns container, the layout is as follows in this example: This same component in a 4 columns gets narrower adapting to the available space. When the mobile viewport is reached the component translates it toolvar as expressed in previous images. ","srcFilePath":"src/pages/docs/patterns/Sites/assetToolbar.md","id":"assetToolbar","location":"/docs/patterns/Sites/assetToolbar.html","url":"/docs/patterns/Sites/assetToolbar.html"},"buttons":{"title":"Buttons","description":"Specific set of button variations specifically designed for sites environment widgets.","layout":"guide","weight":2,"content":" {$page.description} Variations Primary button icon + text Primary buttons with icon and text can be used either in logged or not logged environments. Default Hover Active Secondary button icon + text On the one hand we have the button with icon and text. This button is an extension of Lexicon's secondary button and is built based on the styles of this one. In this way they can be regular or without borders. Default Hover Active These buttons would appear normally as triggers of actions and tools as a part of the Asset Toolbar element. Secondary blue buttons On the other hand we have a type of button that appears only when the user is logged in and has editing permissions on the portlets and their content. These buttons are built following the same pattern of the Secondary Button but using the blue as a distinctive color. Default Hover Active When these buttons are associated with an asset, a blog entry, a knowledge base article or a comment will only appear when hovering over the item to which it is associated. More information about this behavior can be found on the Asset Title Bar documentation. Attributes ","srcFilePath":"src/pages/docs/patterns/Sites/buttons.md","id":"buttons","location":"/docs/patterns/Sites/buttons.html","url":"/docs/patterns/Sites/buttons.html"},"profileInfo":{"title":"Profile Info","description":"Element used to identify the author or owner and other related metadata of an asset in sites environment.","layout":"guide","weight":2,"content":" {$page.description} Attributes Profile info pattern can be defined in different ways as the application needs may vary. Variations Depending on where the sticker is used its size may also change. 40px 48px 56px Attributes Example in Context Different examples of use can be found in blogs and comments. ","srcFilePath":"src/pages/docs/patterns/Sites/profileInfo.md","id":"profileInfo","location":"/docs/patterns/Sites/profileInfo.html","url":"/docs/patterns/Sites/profileInfo.html"},"sites":{"title":"Sites","description":"A tour through the basic patterns that make up the Classic theme that stylizes the Sites environment.","layout":"guide","weight":1,"content":" {$page.description} Building well structured sites also matters to Lexicon. Well structured widgets with a good information architecture definition help consuming and understanding data in a faster way. In this section, we cover the widget structure, as a pattern used by all our Asset Display Templates (ADTs), different smaller patterns that are used in multiple ADTs, and the different ADTs for you to understand how they are built and configured. Further information for each of the components can be found in dedicated pages: Widget Title Bar Asset Title Bar Profile Info Asset Toolbar Buttons Each ADT can be very different but all of them share a same structure not being mandatory the use of any of the elements previously described, but sharing a same look and feel. In a near future more examples will be brought to this section. ","srcFilePath":"src/pages/docs/patterns/Sites/sites.md","id":"sites","location":"/docs/patterns/Sites/sites.html","url":"/docs/patterns/Sites/sites.html"},"widgetStructure":{"title":"Sites","description":"Sites section shows how Lexicon is applied in sites, the live side of Lexicon.","layout":"guide","weight":2,"hidden":"yes","content":" {$page.description} This section covers the widget structure, as a pattern used by all our Asset Display Templates (ADTs), different smaller patterns that are used in multiple ADTs, and the different ADTs for you to understand how they are built and configured. ","srcFilePath":"src/pages/docs/patterns/Sites/widgetStructure.md","id":"widgetStructure","location":"/docs/patterns/Sites/widgetStructure.html","url":"/docs/patterns/Sites/widgetStructure.html"},"widgetTitleBar":{"title":"Widget Title Bar","description":"Bar that contains the title of the widget and the tools that affect the entire widget.","layout":"guide","weight":2,"content":" {$page.description} Definition and Metrics Widget title bar pattern can be defined in different ways as the application needs may vary. This bar is always placed at the top of the widget box. But the box title may grow in length and a definition is needed for different possible size of the widget. Variations Depending on the widget and the fact that the user may or may not access certain editing options, the configuration of this bar may offer different variations. Examples in Context Blogs examples with differet widget title bar configurations. Comments examples where the title bar configuration can be different. ","srcFilePath":"src/pages/docs/patterns/Sites/widgetTitleBar.md","id":"widgetTitleBar","location":"/docs/patterns/Sites/widgetTitleBar.html","url":"/docs/patterns/Sites/widgetTitleBar.html"}},"title":"Sites","description":"Sites section","layout":"guide","weight":3,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Sites/index.md","id":"Sites","location":"/docs/patterns/Sites/","url":"/docs/patterns/Sites/","childIds":["sites","assetTitleBar","assetToolbar","buttons","profileInfo","widgetStructure","widgetTitleBar"]},"Sidebar":{"title":"Sidebar","description":"Sidebar section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Sidebar/index.md","id":"Sidebar","location":"/docs/patterns/Sidebar/","url":"/docs/patterns/Sidebar/","children":{"infopanel":{"title":"Info Panel","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/info_panel.html","description":"An information container that displays additional data from the one shown in the main visualization pattern.","layout":"guide","weight":2,"content":" {$page.description} This sidebar appears always from the right side of the viewport and pushes the container in large viewports and slides over it in small viewports. Usually it is used to show detail information of an element without navigating deeper in the navigation hierarchy. See responsive behavior for more details. In these two images belong to a “Documents and Media” application case as a visual example. Components The components used in the “Info Panel” can vary depending on the application. Following the same example used above, this images show the components used on the “Documents and Media” application. Items carousel Item title and file type Content divided by tabs. Information examples: Details tab: Image Meta information Tags Related assets Versions tab: Versions list Sidebar Height The sidebar always adjusts to the maximum height of the viewport extending the white background color as much as necessary. Item Selection and Navigation Single item selection The information of the item is displayed in the sidebar. Multiple item selection The information of the last selected item is displayed in the sidebar. If you deselect one item, the info of the following numeric item will be shown on the Sidebar Info Panel. Item Carousel When there is more than one selected items, you can browse the information of each of them using a carousel element located on the top of the panel. Responsive Behavior In these examples we show the behavior of the “Info Panel” in different viewport sizes based on the established breakpoints. We have also included the behavior in cases where the bar is visible at the same time as the “Product Menu”. All of these examples also show how the grid of cards would behave in each of the cases. No Sidebar Opened Info Panel opened In viewport sizes under 768px width, the “Info Panel” slides over the container instead of pushing it. ","srcFilePath":"src/pages/docs/patterns/Sidebar/infopanel.md","id":"infopanel","location":"/docs/patterns/Sidebar/infopanel.html","url":"/docs/patterns/Sidebar/infopanel.html"},"product_menu":{"title":"Product Menu","titleLabel":"Portal","description":"A navigation menu that appears from the left side of the screen and provides navigation to different parts of the product.","layout":"guide","weight":2,"content":" {$page.description} ","srcFilePath":"src/pages/docs/patterns/Sidebar/product_menu.md","id":"product_menu","location":"/docs/patterns/Sidebar/product_menu.html","url":"/docs/patterns/Sidebar/product_menu.html"},"sidebar":{"title":"Sidebar","titleLabel":"Portal","description":"A vertical panel that appears from the right or the left side of the screen triggered from certain buttons.","layout":"guide","weight":1,"content":" {$page.description} Lexicon defines different types of sidebar: Product Menu: That allows the user to navigated through the different applications inside the Control Panel and the Site. Info Panel: An information container where to display relevant information that does not fit into the table, list, card or any other visualization. Interaction The way a sidebar panel works is similar regarless the place they are triggerd. In desktop viewports, the panel always pushes the content, while in mobile viewports, the panel is played over the content. In viewport sizes under 768px width, the “Product Menu” slides over the container instead of pushing it. In viewport sizes under 992px width, the “Info Panel” slides over the container instead of pushing it. It is important to highlist that it is important to trigger the panel in its correspondant hierachical level to maintain a proper information architecture.","srcFilePath":"src/pages/docs/patterns/Sidebar/sidebar.md","id":"sidebar","location":"/docs/patterns/Sidebar/sidebar.html","url":"/docs/patterns/Sidebar/sidebar.html"}},"childIds":["sidebar","infopanel","product_menu"]},"Table":{"title":"Table","description":"Table section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Table/index.md","id":"Table","location":"/docs/patterns/Table/","url":"/docs/patterns/Table/","children":{"inlineEditTable":{"title":"Inline Edit Table","titleLabel":"Pending","description":"A table variation that allows user to modify certain values of the entry without going to the detail page.","layout":"guide","weight":2,"content":" {$page.description} Usage Inline edit table is the pattern to use when listing information that may require a quick edition. This pattern is oriented to scenarios like commerce where edition is a frequent action. This table type always has the \"Edit\" button visible as its main identifying characteristic. Each row has two different modes: View mode Edit mode This table doesn't have a responsive version that works in mobile devices. Row modes View mode It is the default status of the row and the table data is not editable in this mode. To enter edit mode the user has to click on Edit button. More actions are possible under the actions button. In case there is an edition screen for the element name it \"Advanced edit\". Edit mode In this mode those row entries that are possible to edit get transformed into a certain input field: text field, numeric field, select, etc. This mode has two different actions: Save: saves the changes and gets into view mode. Cancel: discards the changes and into view mode. Example Attributes The editable row can contain the same elements as a normal table row. We describe the previous example: Checkbox. Main column text. Other columns, where different components may appear. Edit button. Actions button. It is important to remark that the minimum distance between two columns is 24px. ","srcFilePath":"src/pages/docs/patterns/Table/inlineEditTable.md","id":"inlineEditTable","location":"/docs/patterns/Table/inlineEditTable.html","url":"/docs/patterns/Table/inlineEditTable.html"},"table":{"title":"Table","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/table.html","description":"A table is a specific pattern used for comparing datasets in a very direct an analytical way.","layout":"guide","weight":1,"content":" {$page.description} Usage A table view is useful for comparing entries among them that need exhaustive comparison. Tables are very heavy in text display, if you need to display images we recommend you to take a look at lists and cards. A table entry or row don't allow you to display 2 different data types in one same column. The reason behind this decision are comparison and sorting problems. When a table is used together with management bar, the table entries must include the checkbox, as the selection and actions are reflected in the management bar. You can find these examples in dataset display. The previous image points out the different elements that are covered in this page: Table header Section Row Row interaction Table header All column headers are always left-aligned, 14px, and regular weight. Table header can be interactive: Sorting (if available): the column header has an arrow next to it indicating the sort direction, A-z down arrow and Z-a up arrow. The text is underlined on hover state. Drag & drop (if available): the column header shows a drag-icon on hover state. Table header attributes Selected column Sort direction icon Rest of columns Sections Whenever you need to group series of table entries, you can use the table group separator. Row states Default state Hover state A table row in hover state show quick actions from the actions menu that can be performed on the element. A maximum of three actions that represented by icons can appear. When the row is selected the action do not appear in hover state. Selected state Row attributes Checkbox Main column text Columns Actions button Checkbox Main column text Columns Actions button Quick actions displayed on row hover Row interactions A table entry can have a checkbox, a radio or none of them. Selecting a row is only possible by using the checkbox or radio depending on the selection type desired in the table. An interaction with the background does not produce row selection. Text elements in the row can be configured as links to navigate. A row can have none or several actions associated. When there is only one action and it can be represented by an icon, you don't need to make use of the actions menu. Otherwise, use the actions menu on the right side of the row. The first column is usually used as an action: In case of: Folder: it navigates to the next level. File: it navigates to its detail view. Do never use it for preview. Preview is always a secondary action placed in the row action menu. If the link drives the user out of the site, please identify visually that this link will open in a new page. A cell entry could include a button as main action of a table entry. An example could be \"Execute\". Drag and drop is possible for moving selected elements into a folder. A click and drag over a non selected element implies selection. Row hover Row Interaction Limitation Concerning the use of the actions menu on hover there is a limitation. It is not possible to have a row with a button in the default state because it would be impossible to click on it while the actions menu is active in the hover state. Do's and Don'ts Do never hide a action in the table as both static actions in the row and quick actions are not compatible. Quick actions will always hover an action placed in the table row and it will be imposible to reach, in this example, \"Edit\" button. Do Don't Columns drag and drop Drag and drop is configurable in tables. Tables that allow drag and drop handle this action from the column header, letting the user exchange columns position except with the first one. Columns visibility Columns in a table can be shown or hidden only when the table goes together with the management bar and the management bar implements this feature. All columns can be hidden except the first one as it is the reference column. Columns layout A table contains 1 to many columns and how to place them properly can be cumbersome. We provide you a set of advices so you can take quick and easy decisions. While main column must be always placed on the leftmost side, depending on the number of columns and its content you would prefer different table layouts: 2 columns: Place the second column right next to the first column respecting the margins. N columns: Place columns equidistant. Content format and alignment Headers must be always left-aligned and semibold. First column value must be always in semibold. The rest of the columns text values must be in regular. Text values, dates, stickers, labels and badges must be always left-aligned. Numbers, with or without unit must be right-aligned. Example ","srcFilePath":"src/pages/docs/patterns/Table/table.md","id":"table","location":"/docs/patterns/Table/table.html","url":"/docs/patterns/Table/table.html"}},"childIds":["table","inlineEditTable"]},"Templates":{"children":{"datasetTemplate":{"title":"Dataset Template","description":"A Dataset Template shows how a dataset is displayed using Lexicon patterns.","layout":"guide","weight":1,"content":" {$page.description} Layout This template counts with several patterns listed as follows that can be directly mapped with the image. Header toolbar: the actions menu must only contain direct actions over the application in question as import, export, permissions. Navigation bar: includes different entries of the application. If there is only one it must be present in the bar. Search field is optional and only acts over the selected element in the navbar. Dataset display Management bar Breadcrumb (When further than first level) Visualization: Table / List / Cards Pagination bar Table view example List view example Card view example Empty state Empty state on search result ","srcFilePath":"src/pages/docs/patterns/Templates/datasetTemplate.md","id":"datasetTemplate","location":"/docs/patterns/Templates/datasetTemplate.html","url":"/docs/patterns/Templates/datasetTemplate.html"},"formsTemplate":{"title":"Form Template","description":"Form template helps you to understand how forms are built and composed using Lexicon patterns.","layout":"guide","weight":1,"content":"{$page.description} Layout and examples A form template count with several patterns that shape this pattern: Form without side navigation example Header toolbar Navigation bar Form Form with side navigation example Header toolbar Navigation bar Form Left side: vertical navigation Right side: form sheet ","srcFilePath":"src/pages/docs/patterns/Templates/formsTemplate.md","id":"formsTemplate","location":"/docs/patterns/Templates/formsTemplate.html","url":"/docs/patterns/Templates/formsTemplate.html"}},"title":"Templates","description":"Templates section","layout":"guide","weight":2,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Templates/index.md","id":"Templates","location":"/docs/patterns/Templates/","url":"/docs/patterns/Templates/","childIds":["datasetTemplate","formsTemplate"]},"Toolbars":{"title":"Toolbars","description":"Toolbars section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Toolbars/index.md","id":"Toolbars","location":"/docs/patterns/Toolbars/","url":"/docs/patterns/Toolbars/","children":{"management_bar":{"title":"Management Toolbar","titleLabel":"Clay","titleLabelLink":"https://clayui.com/docs/components/toolbars/management_toolbar.html","description":"An extension of a toolbar configured as a combination of different components used to manage a dataset.","layout":"guide","weight":2,"content":" {$page.description} Note: The management bar doesn't have borders. They are used here to provide you with feedback about its height. Usage The Management Bar is always part of a bigger structure and works along with other data management patterns like tables, lists or cards, and its functionality is directly related to them. The Management Bar has two main states: State 1 It is the default state. It displays tools focused on filtering, sorting and data visualization. Checkbox: To select all elements in the current page Filter and Order: dropdown with dropdown menu associated. Please see dropdown with groups Sort toggle button: The arrow identifies the sorting order depending on the selected option inside Filter and Order dropdown. The main attribute, usually the name, states the default sort parameter. Search bar to filter out the current dataset. Visualization button to select the desired visualization. Plus button to add content and folders into the dataset. State 2 It displays contextual tools associated to specific items selected. It is only activated when one or more items from the visualization are selected. The background color and the way to show the icons of the bar in this state changes to differentiate from the default state and establish a visual relation with other forms of showing this tools. Checkbox: To select all elements in the current page Counter: Selected elements counter Select all: To select all elements in the dataset Quick actions: set of quick actions with a visual representation Actions menu: on interaction displays a dropdown menu with all the actions that can be applied over the selected dataset. Requirements The Management Bar has to be fixed on the header of the page so it can be always visible during the vertical scroll. On the default state of the bar, filter and order tools have to be always on the left side and visualization and information tools on the right. On the second state, the tools for selected items appear always on the right side of the bar and vary according to the items selected. Tools shown in the Management Bar are only the ones that the type of data displayed requires it in a specific context. A user can only sort and filter by those elements that are visible in the current visualization. Example of use Selection How selection works using the management bar: State 1: A click in the checkbox, off state, selects all the elements in the current page. State 1 and 2: The checkbox is marked with a dash when the selection is partial in the whole dataset. State 2: Even if the checkbox is with a dash a click selects all elements in the page. State 2: There is a \"Select all\" that selects all elements in the dataset. State 2: Unselecting the checkbox deselects all selection done over the dataset. Filter and order A dropdown button triggers a dropdowm menu with groups. This configuration is thought to clean the management bar providing the user with more specific mechanisms to find data. Filter by: used to filter in/out elements from the dataset. Order by: used to order the dataset by one of the available attributes. In case there is no possible order or only one order this section must not appear. Group by: used to group the dataset in different ways. A title and a data provider with the different classification terms per each criteria must be provided. In case there is no group by criteria or there is only one criteria this section must not appear. View change This icon button allows to change visualization among tables, lists and cards. This button must not appear if there is only one possible visualization. Search When a management bar contains a search field and it is used to filter elements, there is a thin stripe informing the user with the total number of results. Layout Variations The functionalities that are not going to be used in the management bar disappear. So the Search field grows towards the disappearing elements, as shown below. The general exemple with all the functionalities: Some scenarios might force you to not have selection or filters. In this case you can freely remove what is not needed for your specific use case. In this example, we only need the search field, a button to change visualizations and the plus button to add elements into the dataset. Another possible scenario might not require you to have the visualizations and the plus buttons. In this case, the management bar layout will be as follows: Having the management toolbar only configured with the search field is the minimum possible configuration. Last but not least, a very common case, and aforementioned in View Case section, is to go without the visualizations button. Mobile State 1 In mobile version all actions have been transformed into icons to reduce spaces and limit the bar to only one line providing the interface with more space for content rather than tools. State 2 In contrast to the desktop version, no actions are facilitated outside the actions menu to clean the bar. Search By tapping on the magnifying glass icon button, the management bar gets into this state. The search field hovers the whole bar providing a better interaction space. Search results After tapping on intro in the search field the management bar return to state 1 with a summary line of the results found. Mobile Layout Variations When not every feature appears in the management bar, the Search field grows towards the disappeared functionality. The general case, with all the features: The dataset has only the options of changing the view mode and adding new elements which is the example below. In this case, the options of selection and filter and order are available. The dataset display in this case, only allows to Search. The most common option allows all possibilities except the way to change the view. Note: The management bar doesn't have borders. They are used here to provide you with feedback about its height. ","srcFilePath":"src/pages/docs/patterns/Toolbars/management_bar.md","id":"management_bar","location":"/docs/patterns/Toolbars/management_bar.html","url":"/docs/patterns/Toolbars/management_bar.html"},"toolbar":{"title":"Toolbar","description":"A toolbar is a set of actions related to an specific context grouped in an horizontal bar.","layout":"guide","weight":1,"content":" {$page.description} Usage A toolbar is a generic bar that helps grouping actions in a way that they are visually organized for any context of use in Lexicon. Its height changes depending on the height of the elements it contains. The toolbar always maintains the vertical alignment. You only need to define the number of blocks or containers that you want to have in your toolbar and place the elements inside it. These blocks or containers are of 2 different types: Field: is used to make tight groups. Content: is used to span as much as possible in the rest of the space. In case there are several contents the available space is equally divided. Layout For a better understanding of the previous sections, here are some example layouts: Example 1: Three consecutive fields Example 2: Three consecutive contents Example 3: Field - Content - Field To set a better context the folling examples over the management bar will help you to understand the previous images better: Attributes The horizantal distance between elements is always 16px. This change into 8px in mobile viewports. When talking about vertical distances, the minimum will be always 16px. There is an exception of the search field that we want it to take a higher relevance and its height is 40px. In this case, the bar top and bottom margins are 12px. ","srcFilePath":"src/pages/docs/patterns/Toolbars/toolbar.md","id":"toolbar","location":"/docs/patterns/Toolbars/toolbar.html","url":"/docs/patterns/Toolbars/toolbar.html"},"translation_bar":{"title":"Translation bar WIP","description":"The translation bar is a toolbar that allows the user to choose the languages when translating content.","layout":"guide","weight":2,"hidden":"yes","content":" {$page.description} Usage The toolbar is always used inside a form context. The toolbar has a default language which always appears to the leftmost side of the bar. Languages are added by clicking in the plus button. Changing the default language is possible using the link, which triggers a modal where to change the default language. ","srcFilePath":"src/pages/docs/patterns/Toolbars/translation_bar.md","id":"translation_bar","location":"/docs/patterns/Toolbars/translation_bar.html","url":"/docs/patterns/Toolbars/translation_bar.html"}},"childIds":["toolbar","management_bar","translation_bar"]}},"title":"Pattern Library","url":"/docs/patterns/alerts.html","icon":"lexicon-site-docs","weight":3,"content":" ","srcFilePath":"src/pages/docs/patterns/index.soy","id":"patterns","location":"/docs/patterns/","customURL":true,"childIds":["actionsDefinition","alerts","badges","buttons","cards","Charts","columns_view","confirm_message","dataset_display","dropdowns","emptyStates","fileUpload","Forms","icons","imageSelector","labels","link","list","loading_indicator","modals","Navigation","pager","pagination","popovers_tooltips","progress_bars","Sidebar","stickers","Table","timelines","Toolbars","Templates","Sites","tabs"]}},"childIds":["lexicon","designPrinciples","patterns","news","resources","search"]}},"childIds":["docs"]}}