{"title":"lexicon-site","googleAnalytics":"UA-37033501-5","index":{"title":"Home","description":"Something nice and compelling about the project. Make it short and sweet.","content":" Build consistent and beautiful web experiences easily ","srcFilePath":"src/pages/index.soy","id":"pages","url":"/.","children":{"docs":{"title":"Docs","description":"Documentation description","content":" Docs Start learning how to leverage the power of in your project. Search Choose a Guide Each one provide step by step coverage for every core feature. ","srcFilePath":"src/pages/docs/index.soy","id":"docs","url":"/docs","children":{"search":{"title":"Search","description":"Documentation search results.","hidden":true,"content":" Electric Docs Start learning how to leverage the power of Electric. ","srcFilePath":"src/pages/docs/search.soy","id":"search","url":"/docs/search.html"},"lexicon":{"title":"What is Lexicon","description":"User experience design language.","layout":"guide","icon":"lexicon-site-layers","weight":1,"content":" Design language Lexicon is a design language created with the aim of providing a common framework for building interfaces within the Liferay product ecosystem. A guide to design principles, components, patterns and contexts of use that contributes to give consistency and coherence to these products and, ultimately, provide a satisfactory and unified experience to its users. Lexicon is a constantly evolving project. An iterative work that seeks to improve and gradually adapt to the evolution of technology and people. Modular approach The lexicon approach to interface design is based essentially on modularity. It is configured as a system that from a controlled number of components is able to respond to the multiple and different needs of liferay products. An exercise in synthesis, abstraction and coordination that seeks to simplify processes, reduce production times and, above all, to guarantee the consistency we want for the use experience. For this, the construction of Lexicon is based on the Atomic Design theoretical approach. A work methodology based on modularity that seeks to give a more hierarchical and organized logic to the creation of interfaces design systems. This methodology has been ideated and developed by the designer Brad Frost and is based on nonlinear process organized across five stages: Atoms, Molecules, Organisms, Templates and Pages. Lexicon site Lexicon Site is then presented as the necessary platform for the diffusion and access to Lexicon system by designers, developers or any other person involved in the creation of digital products. Mainly focused on Liferay community, but open to anyone who wants to make use of its content and also want to contribute with their own proposals and suggestions. ","srcFilePath":"src/pages/docs/lexicon/index.md","id":"lexicon","url":"/docs/lexicon"},"news":{"title":"News","description":"Keep updated.","layout":"guide","icon":"lexicon-site-bell","weight":3,"content":" March 30th, 2017 Lexicon site release Lexicon launches its documentation site to provide designers, developers and other people envolved in the design process. This guideline is created to let you understand the boundaries of this pattern library a help using the interactions patterns created by Liferay. ","srcFilePath":"src/pages/docs/news/index.md","id":"news","url":"/docs/news"},"patterns":{"children":{"Breadcrumb":{"title":"Breadcrumb","description":"Breadcrumb navigation","layout":"guide","weight":1,"content":" Description Breadcrumb is a secondary navigation pattern that identifies the page position inside a hierarchy. Usage The breadcrumb is always horizontal. Long crumbs can be reduced using ellipsis. All crumbs are links to the respective navigation level, except last crumb that is only used to identify the current page. ","srcFilePath":"src/pages/docs/patterns/Breadcrumb.md","id":"Breadcrumb","url":"/docs/patterns/Breadcrumb.html"},"alerts":{"title":"Alerts","description":"Alerts are used to capture the attention of the user in an intrusive way","layout":"guide","weight":1,"content":" Description Alerts are used to capture the attention of the user in an intrusive way. Sometimes just to say that something went right, others to say that something needs to be reviewed. Alerts are possible to define in 4 different colors, grey for the default type of message and four other corresponding to status colors. Types | Type | Usage | | ----- | ----- | | Information | Blue color. Information alerts are used to inform users about things that occur while they are carry out a task. | | Success | Green color. Success alert messages will appear when everything was ok. (E.g.: “The user was created successfully”). | | Warning | Yellow color. This alert lets users know that the action they performed was done but there are some issues with it. (E.g. The item was created but with there were some issues). | | Error | Red color. This alert indicates that something went wrong after performing an action. (E.g.: Form couldn’t be saved because some data was missing) | Variations Temporary alert stripe This message is meant to disappear after a short period of time, so it must be the case that the user doesn't have time to read it and there must not be a consequence for not reading it. This type of alerts have embedded links in case you need them. Dismissible alerts stripe Use this kind of alerts to inform users about something and to ensure they don‘t miss the information. These alerts can contain links to carry out actions such as undoing actions or visiting a page. This alert is placed right below the navigation bar. Alert notification Notifications display information about something that has happened or is happening in the system. These alerts are not related to actions that are being performed by the user at that moment. Unlike alerts, notifications are displayed on the top right corner of the screen. Both desktop and mobile notifications have similar dimensions. Attributes ","srcFilePath":"src/pages/docs/patterns/alerts.md","id":"alerts","url":"/docs/patterns/alerts.html"},"badges_labels_stickers":{"title":"Badges, Labels and Stickers","description":"Badges, Labels and Stickers usage.","layout":"guide","weight":1,"content":" Badges Description Badges help highlight important information such as notifications or new and unread messages. Badges have circular borders by default. Sizes | Size | Usage | | ---- | ----- | | | Small: Use it to mark the number of notifications in a user sticker. | | | Default: Use it for marking states. | | | Large: Use it when previous don't apply. | Types | Type | Usage | | ---- | ----- | | | Used to identify.| | | Used to identify with the possibility of removing it.| Attributes Labels Description Labels are a mechanism to categorize information providing quick recognition. Usage Use labels to organize groups of items in your application. Labels have rounded borders by default. Sizes | Size | Usage | | ---- | ----- | | | Small: Use it to mark the number of notifications in a user sticker. | | | Default: Use it for marking states. | | | Large: Use it when previous don't apply. | Types | Type | Usage | | ---- | ----- | | | Used to identify.| | | Used to identify with the possibility of removing it.| Attributes Stickers Description Stickers are a visual way to quickly identify content in a different way than badges and labels. Stickers can be either numbers or characters but always restricted to a maximum number of 3 characters. A sticker can also contain just an icon. Stickers are always squared. Usage Use stickers to visually identify elements in a dataset that are part of a same group. You can use any color you want for stickers. Sizes | Size | Usage | | ---- | ----- | | | 22x22. Use it in smaller contexts where you only need visual identification but not manual interaction with this element. | | | 32x32. Use it in cards that are image based, allowing to see more parts of the image. | | | 44x44. Use it in cards that are not image based, or list entries. | Position Stickers can have different positions: Static Inside (interior to the element that contains it) or outside (overlapping the border of the element that contains it): Bottom left Bottom right Top left Top right The most used cases in Liferay DE are inside bottom left and static. ","srcFilePath":"src/pages/docs/patterns/badges_labels_stickers.md","id":"badges_labels_stickers","url":"/docs/patterns/badges_labels_stickers.html"},"buttons":{"title":"Buttons","description":"Buttons communicate an action to happen on user interaction","layout":"guide","weight":1,"content":" Description Buttons communicate an action to happen on user interaction. Types | Type | Usage | | ---- | ----- | | | Primary: The primary button is always use for the most important actions. There can't be two primery actions together or near by. | | | Secondary: The default button is used for secondary actions. | | | Link: The link button is used for tertiary actions or opposite actions to the primary one. | States Default state Active & Hover states Disable state Sizes | Size | Usage | | ---- | ----- | | | Large: Used for main page actions like Save or Cancel. | | | Default: Used for actions inside a page, like dropdowns, button groups, split buttons. | | | Small: Use it on reduced spaces. | Variations Icon button Buttons can icons insted of text and for that icons need to be monospaced inside the button. Lexicon do not use buttons with text and icon, or text and loading indicator. Icon buttons are used intensively in management bars. Block level button All buttons can also be configured at block level. Use this configuration in those cases that you need the user to realize there is an important action to be done. It could be used as a load more action below a list, as an example. Please do not use it in forms. Be always careful with the type button to use, primary is not always the best choice neither the only configuration. Dropdown button Dropdown buttons are always used together with a dropdown menu. Split button Split buttons are used in those cases where you need to offer the user a quick main action but salso secondary actions. Button group Button groups are used to switch between complementary views for example, but they must never be used for complementary actions and \"Change and Cancel\" or \"Save and Cancel\". In those cases the use of single buttons is the correct solution. Action button The action button is always a primary button with a special size of 64x64 due to its importance. This button floats on the bottom right corner of the screen. It contains all the adding or creating actions in a context. When there is only one action to perform in the page where it is used the button triggers the action. In case there are more that one actions, all the actions appear listed in a dropdown panel that is triggered on click interaction with the button. Once selected the action in the list, the dropdown is closed. Attributes ","srcFilePath":"src/pages/docs/patterns/buttons.md","id":"buttons","url":"/docs/patterns/buttons.html"},"cards":{"title":"Cards","description":"Cards are a visual representation of data","layout":"guide","weight":1,"content":" Description Cards are a very specific visual representation of data. Usage Cards is a pattern that is heavy on image usage, therefore we recommend to use it only if you have images asociated to your content. A good example of this could be your users database or an image library. Cards are not meant to compare information in an exhautive way but a light way. In case you need exhaustive comparison and not based on image comparison, you must use a table. Cards in Lexicon are open to many configurations. We provide a flexible card layout for you to configure it as you want. Later on this page we provide a series of examples we use in our systems for you to get inspired. Layout By providing a flexible layout, Lexicon opens you a wider range of possible configurations for your card. Every element can be used or deleted adapting it to your specific needs in each use case. As you can see in the following image, a card is shaped by: Image: main element in this pattern. Checkbox or radio button: useful when working together as a visualization type with a management bar. Sticker or User image: Useful to identify the file type or the owner. Information area Text lines of different importance: relevant information. Actions menu: actions associated to the card Among these elements, the only one that can't be removed for the pattern meaning is the image. It is important to highlight that images can have different size configuration in relation to aspect ratio and cropping. Please, check images section in Quartz to get more information about it. Attributes Examples of use Variations Horizontal card This card variation is meant to have horizontal representations of information. This card has the same amount of elements as the previous explained. The main purpose of this card is to represent folders, therefore we allow to remove the image in this card type. ","srcFilePath":"src/pages/docs/patterns/cards.md","id":"cards","url":"/docs/patterns/cards.html"},"collapsible_search":{"title":"Collapsible search","description":"Simple search solution for small screens.","layout":"guide","weight":1,"content":" Description Collapsible search provides a solution for the search text field in mobile resolution as the viewport size is reduced. Usage The search text field is reduced to just a button icon with the magnifying lense. When the button is tapped the field appears hovering the rest of the elements in the bar. Once the search action is performed the field gets to its initial state. This pattern is commonly used when a search text filed placed in a bar gets to a mobile resolution. It can be the case of a navbar, or a management bar. The following animation shows this pattern works: ","srcFilePath":"src/pages/docs/patterns/collapsible_search.md","id":"collapsible_search","url":"/docs/patterns/collapsible_search.html"},"colors":{"title":"Color palette","description":"Color palette definition and usage.","layout":"guide","weight":1,"content":" Description Color palette defines a set of colors to be used in the system. Each of the colors has a meaning and a purpose to create a robust a design system. Usage Colors have a huge impact in a system as they define the visual identity, they bring armony, they communicate, among other caracteristics. Lexicon defines the following color palette that you are free to change for your own. Primary colors an Primary colors define part of the visual identity of Lexicon as a system. These colors have been carefully thought to be easily combined and be sure that accessibility is well covered. | Color | Usage | | ---- | ----- | | Anchor navy | Used as background color in navigation. | | Secondary blue | Used as default color. | | Primary blue | Used for active state and hover, primary buttons, etc. | | White | Used when secondary blue doesn’t respect accessibility rules. | Secondary colors Secondary colors are frequently used colors, also important as primary but do not define the visual identity in a stronger way as Primary colors do. | Color | Usage | | ----- | ----- | | Blue | Information | | Green | Success | | Orange | Warning | | Red | Error | | Grey | Secondary light | Each of the color has a variation. These colors and its variations are normally used together, one for text color and the second one as a brackground color for the message. Changing Lexicon color palette Changing the prestablished color palette is always possible. From Lexicon we understand that our color palette might not fit your needs or requirements as you can have a different corporate image. You just need to set you colors instead of our colors. ","srcFilePath":"src/pages/docs/patterns/colors.md","id":"colors","url":"/docs/patterns/colors.html"},"dataset_display":{"title":"Dataset display","description":"Relation between management bar and dataset visualization.","layout":"guide","weight":1,"content":" Description A dataset display is the combination of a management bar with one or many data visualization types. The most common visualization types used are table, list and card. Usage This pattern is used when the elements of the visualization require colective management, therefore the management bar becomes important as it has to facilitate the tools needed to work with the data set. Empty state It is important to let the user know what happends in empty states and let them know what has happend and how to perform actions to move out from that empty state. In Lexicon we use our emoticons library as a visual support together with a text message to help the user. It is very important that this message is clear and let the user understand what to do next. Empty search state As stated in the previous case, it is important to help the user understanding what happens in empty states. Here is the example for a empty search result. Invidual actions Individual actions are all those actions that an element has. This actions are always possible to reach from the element it self throw the actions menu. Some of this actions are also placed in the management bar when only one element fromt the dataset is selected. These actions are always represented by a metaphor, , they are buttons with icon. Only those actions that can be easily represented by an icon will be there. Not all possible represented by an icon must be there, only the ones considered as more relevant. Colective actions Colective actions are shown in the management bar when more than one element is selected in the dataset. In case there are colective actions that don't have an icon representation the can be placed in a dropdown triggered from the actions button. Drag and drop example The following animations shows how a drag and drop action works in a list view. ","srcFilePath":"src/pages/docs/patterns/dataset_display.md","id":"dataset_display","url":"/docs/patterns/dataset_display.html"},"dropdowns":{"title":"Dropdown","description":"Dropdown menu variations and usage.","layout":"guide","weight":1,"content":" Description Dropdowns are a list of options related to the element that triggers them. Usage Dropdowns are used to list a set of options that are not easy to manage in the screen. This mechanism helps to clean-up the screen making everything more implicit. Dropdowns are usually triggered from a dropdown button or a button with icon. This are the two most extended cases in Lexicon. Closing a dropdown can be done by: Selecting an option in the panel, if they are mutually exclusive. Clicking on the button that triggered it. Clicking outside the panel. A dropdown menu can contain any kind of basic form component / element like textfield, list of options, list of options with radio buttons, list of options with checkboxes, or button. Types Default The default dropdown is just a panel not prepared for scrolling the content inside it. Use this type when the number of options you want to offer is short or the panel is big enough to contain all the elements you want to use. Scrolling content Scrolling content type is prepared to have scroll in all the dropdown menu or just a part of it. Use it in case your dataset is occupies more than the space you want to provide the dropdown menu in the screen. Example of use This example shows you how dropdowns would look like in a screen when displayed from the kebab menu and the action button. As you can see in the example the dropdown panel arrow can be positioned in different positions. Check Quartz implementation to get more details on that. Attributes ","srcFilePath":"src/pages/docs/patterns/dropdowns.md","id":"dropdowns","url":"/docs/patterns/dropdowns.html"},"grid":{"title":"Grid","description":"Grid, measures and distances.","layout":"guide","weight":1,"content":" Description Lexicon uses a 4px grid as the minimum unit of measure in terms of distance and space. 4px is a right decision as it allows as scalling with accuracy in alignment. Visual order and cleaness is one of the aims of this system. 4px grid The grid used in interfaces built with Lexicon follows the following rules: Maximum grid width: 1280px Gutter: 32px Margin: 16px Number of colums: 12 Column width: varies with the canvas width Note: Quartz implements Lexicon on top of bootstrap using the default bootstrap grid that has a gutter of 30px and a margin of 15px. 4px usage A 4px minimum unit of measure allow us to play with values as 8px, 12px, 16px, 20px, 24px and so on. The previously stated units are the ones most used in Lexicon. The follwing set of examples shows how we use this measures to build up our system. Please refer to attributes section inside patterns to see more use cases and learn how Lexicon applies them. Form example ","srcFilePath":"src/pages/docs/patterns/grid.md","id":"grid","url":"/docs/patterns/grid.html"},"header_toolbar":{"title":"Header toolbar","description":"Usage and confiration.","layout":"guide","weight":1,"content":" Introduction Header toolbar is a Toolbar based component used in headings for portlets, mobile pages, and page sections. Usage This toolbar is used in almost every page in the system. It can have different configurations as you can see in examples section: Left area: Used for actions as triggering the side menu and back navigation Center area: Used for the page or application title. Right area: Used for actions, explicit when it is possible and a maximum number of 3. Implicit inside a kebab menu when the metaphor is not clear. Example ","srcFilePath":"src/pages/docs/patterns/header_toolbar.md","id":"header_toolbar","url":"/docs/patterns/header_toolbar.html"},"icons":{"title":"Icons","description":"Lexicon icon library and the use of external libraries.","layout":"guide","weight":1,"content":" Description Icon is a visual metaphor representing a concept that lies behind the idea and/or action. Liferay icon library Liferay has its own icon library created for the porpuses of the projects that use Lexicon. You can also use other icon libraries. Check our icon library. Language flags People tend to have pretty strong opinions on whether flags should be used as a visual cue for indicating a language, mainly because in many parts of the world, the flag may have cultural and geographic meanings that we might not be aware of, or the flag itself isn't fully accurate to the dialects spoken in that region. While we understand that reasoning, we've found that the times they are actually needed (when a user is not familiar with the currently displayed language) somewhat eliminates using other mechanisms, such as the name of the language (since the current language could be in an entirely different character set). Given this, there is often at least some familiarity with the identity of a country that speaks a shared language. Check our flags library. Other icon libraries Font Awesome and Glyphicons are good alternatives in case you don't want to use Lexicon icon library. Usage Icons can be used only when the metaphor is direct and clear. In case there is not a good icon to represent the concept you want to transmit, it will probably better to use words. Icons must be reserved to broad accepted visual ideas. Why do we use SVG? SVG gives us and you a greater amount of freedom in styling the icons, as well as a higher level of fidelity and clarity in the icons. Font icons, while fairly simple, also suffer some drawbacks, mainly with sub-pixel aliasing that cause the quality to not be as high as we would like. Also SVG allows for multi-color icons. Help icon Help icon is used in lexicon together with tooltips or popovers. As an example, it gives a better visual clue to users to reach an explanation about a field in a form. Sizes | Size | Usage | | ---- | ----- | | Icon-large | Icon-large (x1.33) | | Icon-2x | Icon-2x (x2) | | Icon-3x | Icon-3x (x3) | | Icon-4x | Icon-4x (x4) | | Icon-5x | Icon-5x (x5) | | Icon-2x | Icon-2x (x2) | ","srcFilePath":"src/pages/docs/patterns/icons.md","id":"icons","url":"/docs/patterns/icons.html"},"list_groups":{"title":"List","description":"Dataset representation.","layout":"guide","weight":1,"content":" Introduction List is a visual representation of a dataset that provides more flexibility for arranging the data to display than a table and that is less visual explicit than a card view. Usage A list view is useful for comparing entries among them that do not need exhaustive comparison. In case you need exhaustive comparison use the table view. A list allows you a free way of displaying information. While the table isn't meant to have several text labels in a column, list is the pattern for doing that, as you can see in the following examples. Not all the element in a list entry are mandatory, feel free to delete and include the ones you need. When a list is used together with management bar, the list entries must include the checkbox, as the selection and actions are reflected in the management bar. List group Whenever you need to group series of list entries, you can use the list group heading for that. Row interactions Selecting a row is only possible by using the checkbox. Text elements in the row can be configured as links to navigate. A row can have none or several actions associated. When there is only one action and it can be represented by an icon, you don't need to make use of the actions menu. Otherwise, use the actions menu on the right side of the row. If the action you want to perform of is \"Edit\", place it as a link in the title to navigate to an edition screen for the element. Row states Default states Selected state Attributes Example of use ","srcFilePath":"src/pages/docs/patterns/list_groups.md","id":"list_groups","url":"/docs/patterns/list_groups.html"},"loading_indicator":{"title":"Loading indicator","description":"Providing feedback to users on processes.","layout":"guide","weight":1,"content":" Description Loading indicator shows the user that an external process, like a connection, is being executed. Usage This feedback mechanism is essential for the user to understand that something is happening. Please remember to include it when there is a connection to a server and at the same screen shows the answer to the user. Please don’t use spinners inside buttons. In case you need a spinner for an action triggered by a button, place the spinner to one of the sides of the button. Types | Types | Description | | ---- | ----- | | | Dotted spinner default | | | Linear spinner default | Size Make a responsive usage of the sizes that help the user to understand that something is happening not being aggressive. The context of use will help you understanding the size to use. | Size | Description | | ---- | ----- | | Small | 10px | | Default | 16px | | Medium | 32px | | Large | 64px | ","srcFilePath":"src/pages/docs/patterns/loading_indicator.md","id":"loading_indicator","url":"/docs/patterns/loading_indicator.html"},"management_bar":{"title":"Management bar","description":"Specific toolbar for dataset management.","layout":"guide","weight":1,"content":" Description Management Bar is an extension of Navbar. Combine different management-bar components to create a toolbar that fits your needs. Usage The Management Bar is always part of a bigger structure and works along with other data management patterns like tables, lists or cards, and its functionality is directly related to them. The Management Bar has two main states: State 1 It is the default state. It displays tools focused on filtering, sorting and data visualization. State 2 It displays contextual tools associated to specific items selected. It is only activated when one or more items from the visualization are selected. The background color and the way to show the icons of the bar in this state changes to differentiate from the default state and establish a visual relation with other forms of showing this tools. The tools shown in the management bar in each state are always related to the type of data displayed and type of visualization. The Management Bar never shows elements that not are required in a specific context. Requirements The Management Bar has to be fixed on the header of the page so it can be always visible during the vertical scroll. On the default state of the bar, filter and order tools have to be always on the left side and visualization and information tools on the right. On the second state, the tools for selected items appear always on the right side of the bar and vary according to the items selected. Tools shown in the Management Bar are only the ones that the type of data displayed requires it in a specific context. A user can only sort and filter by those elements that are visible in the current visualization. Example of use Attributes ","srcFilePath":"src/pages/docs/patterns/management_bar.md","id":"management_bar","url":"/docs/patterns/management_bar.html"},"modals":{"title":"Modals","description":"Capturing user attention in a process to solve a task of the process.","layout":"guide","weight":1,"content":" Description A modal is a box with content displayed on top of the page to capture the user’s attention for an specific action inside the same process. Modals are subordinated to pages. Usage Modals can be build in different sizes and configurations. Depending on the amount of content you have you will decide one of them. Lexicon recommends to not use full-width size as it will be like a complete new page. If you are in this situation please consider creating a new page instead of a modal. Modals belong to a screen, therefore a modal window must never be triggered from another modal window. When a modal has footer, the actions are placed inside and aligned to the left. There is an order of importance and the sequence is: Primary button (only one), secondary button, and button link. Size Modals can be configured in 4 different size and they are defined as table shows: | Size | Description | | ---- | ----- | | Small | 300px | | Default | 600px | | Large | 900px wide modal in window sizes greater than 992px. 600px wide modal in window sizes between 768px and 992px. | | Full width | A modal that stretches to fit the browser window with 45px padding on every side. | Configurations Lexicon allows your modal to have different configurations related to your needs. These needs vary from case to case and that is why not every modal in the system needs to be equal, but needs to follow certain rules. Header, body and footer This is the classic composition of a modal window with its three main parts: header, body and footer. Header and body This is the case when you don't need a footer bar to place your icons. Body and Footer This case is thought for those cases where you need to just show text and buttons to agree or cancel. iFrame in the body It is always possible to bring an iFrame inside the body. For more information about this check Quartz. Mobile When a modal reaches the mobile viewport size its look and feel is transformed to the one you see below offering a mobile friendly version. Modal occupies the hole screen allowing only the interaction with the modal and its content. Attributes ","srcFilePath":"src/pages/docs/patterns/modals.md","id":"modals","url":"/docs/patterns/modals.html"},"nav tabs":{"title":"Nav tabs","description":"Tabs let the user move around parallel content in a same context.","layout":"guide","weight":1,"content":" Description Tabs let the user move around parallel content in a same context. Usage Use tabs when you need to move between views on the same context. Split your information into groups that are easy to identify by your end users. Order your tabs in a natural way for your users. Tabs are meant to be used when you don’t need to compare contents. All tabs in a tab bar must follow the same style and type. Changing styles in tabs can produce the feeling of navigation and this is not the desired outcome for this pattern. A tab must change to selected state on user selection. It must be easy to identify among other tabs. There can only be one tab selected at same time. The rest of the tabs must be possible to read. Tab label must be short, maximum two words, clear and concise. Do not use all caps in the label, this complicates the readability of the tab. One of the tabs must be always pre selected Variations Lexicon counts with two tab bar styles. If there is the case where you have to use both in a page, place first Bordered tabs and second Not bordered tabs. Bordered tabs Nav tabs default are used in exterior levels and just below the navigation bar. This kind of tabs give a better context as the border helps the integration with a box below it. Non-bordered tabs Non-bordered tabs are used in interior levels such as inside forms and in search results for different repositories. Attributes ","srcFilePath":"src/pages/docs/patterns/nav tabs.md","id":"nav tabs","url":"/docs/patterns/nav tabs.html"},"nav":{"title":"Nav","description":"Nested navigation.","layout":"guide","weight":1,"content":" Description Nav is the pattern that defines the navigation pattern. Variations Nav can be use either for horizontal or vertical navigation structures. This page shows different simple use cases of this pattern that will be applied in a bit more complex patterns such us navbar. Vertical A vertical navigation can be simple or it can be nested, where some of the entries could have interior levels of navigation. In a nested navigation usually the first level opens the second. Levels that open interior levels must be always identified with a disclosure arrow that indicates this action. It is possible to nest as many levels as you want in a nested navigation but we encourage to use a maximum of two nested levels. Horizontal A nav can be also configured in horizontal for different purposes as can be the navbar. ","srcFilePath":"src/pages/docs/patterns/nav.md","id":"nav","url":"/docs/patterns/nav.html"},"navbar":{"title":"Navbar","description":"Defines navigation in applications or sites.","layout":"guide","weight":1,"content":" Description A navigation bar, navbar, is an horizontal bar that provides several access points to different parts of a system. Usage Navbars in DE are used inside applications to provide navigation among their different pieces. A navbar can contain one or several entry points in the form of tabs at the leftmost side and search field at the rightmost side. In case there are many options to navigate, you can make use of a dropdown to host some of the navigating options. The search textfield activity must work only over the active option in the navigation bar. When the viewport resizes to smaller screen sizes the navbar entries collapse intro a dropdown where the active screen gets populated and selected in the dropdown. Examples Example 1: Navbar with search bar Example 2: Navbar with search bar and focus state on search textfield Example 3: Navbar with navigation options in dropdown and search. The second image corresponds to its responsive view. For more information about search, please visit collapsible search Attributes ","srcFilePath":"src/pages/docs/patterns/navbar.md","id":"navbar","url":"/docs/patterns/navbar.html"},"pager":{"title":"Pager","description":"Navigation between pages of a process or task.","layout":"guide","weight":1,"content":" Description Pager allows navigation between pages of a process or task divided in subtasks or also called pages. Usage Pagers are commonly used in forms that are chucked because of their length. Variations Default pager Use it when you need a simple pagination pattern that does not require to change the page size. Aligned pager Aligned pager pushes the links to the left and right. States States are important in pagers to let your users understand where the process has its limits and where it can go. Please take are of enabling and disabling them properly depending on the sequence. Sizes Usage each size depending on the context, take into account the available space and the hierarchical importance. | Size | Description | | ---- | ----------- | | Small | The font-size is 12px and the proportions are smaller. | | Default | The font-size is 16px and the proportions are smaller. | | Large | The font-size is 18px and the proportions are bigger. | ","srcFilePath":"src/pages/docs/patterns/pager.md","id":"pager","url":"/docs/patterns/pager.html"},"pagination":{"title":"Pagination","description":"Navigation between chunks of a dataset.","layout":"guide","weight":1,"content":" Description Pagination allows navigation between chunks, also denominated pages, of a dataset. Sizes | Size | Description | | ---- | ----- | | Small | The font-size is 12px and the proportions are smaller | | Default | The font-size is 16px | | Large | The font-size is 18px and the proportions are bigger | Variations Pagination Use it when you need a simple pagination pattern that does not require to change the page size. Pagination bar A pagination bar is pagination with additional functionality. This added functionality comes with a page size selector placed on the left size of the bar. To the right side we incorporate a label to provide feedback on the exact chunk of information displayed from the dataset. On the right side of the pagination bar there is the classic pagination that adapts depending on the number of pages. Use it when you need a complex pagination pattern that requires changing the page size and recalculating the number of pages. This pattern gives feedback about the chunk of dataset you are viewing. Interactive components: Entries dropdown: to select the number of elements per page. You can configure you page size options. Arrows: to move to previous or next page. Ellipsis: to select intermediate pages not possible to see due to the number of pages. Attributes ","srcFilePath":"src/pages/docs/patterns/pagination.md","id":"pagination","url":"/docs/patterns/pagination.html"},"panel":{"title":"Panel","description":"Panels separate your content.","layout":"guide","weight":1,"content":" Description Panels help to separate your content. Usage Panel are use to help separating content a making processes as reading or filling a form easier to the user. Panels are a way of chunking into smaller pieces. Configuration Panels can be configured in different ways: Body Use this configuration to separate content inside a form. Header + body Use this configuration when you need to se parate a content that needs a title and the title needs to capture the attention of your user. Do never use it to collapse content without a disclosure arrow. Use an accordion in that case. Variations Accordion Panels can be collapsible. Whenever there is a collapsible panel the header must include a disclosure icon as an affordance to let the user understand that open and close actions can be performed. Please, see that when a panel is open the header is highlighted with a blue line below it marking the active state. It is not a good practice to anidate accordions. Please try to avoid it. In the following example you can see the accordion working. It is also optional to close all entries when a diferent entry opens. Attributes ","srcFilePath":"src/pages/docs/patterns/panel.md","id":"panel","url":"/docs/patterns/panel.html"},"popovers_tooltips":{"title":"Popovers and Tooltips","description":"Popovers and Tooltips usage.","layout":"guide","weight":1,"content":" Popovers Popovers are short helpful and/or descriptive pieces of information that appear on hover state. Usage Popovers are used together with the question mark icon as an affordance to let the user understand there is something to read that can be useful. Popovers contain information such as help to understand a context. Attributes Tooltips Tooltips are brief pieces of information that appear on hover state over an element to clarify the meaning or use of an interaction element for the user. Usage Tooltips are used in with icon buttons to help understanding the metaphor they transmit. They can be also used with links or images. The tooltip appears on hover state and disappears when hover ends. This pattern does not exist in mobile a hover is not a possible state. Please make a right use of the arrow positioning as it could drive to misunderstandings when it doesn’t point to the correct interface element. Attributes ","srcFilePath":"src/pages/docs/patterns/popovers_tooltips.md","id":"popovers_tooltips","url":"/docs/patterns/popovers_tooltips.html"},"progress_bars":{"title":"Progress bars","description":"Progress indicator to show the process completion.","layout":"guide","weight":1,"content":" Description Progress bar is a progress indicator used to show the completion percentage of a task. Usage Progress bars can be classified in two groups: Indeterminate: where there are no intermediate states. As long as the process is running the progress bar grows continuously from 0% to 100%. Use it for system processes. Determinate: where there are intermediate states in the completion process. Used to show the user where is inside a process divided in steps. Use it for user processes. Sizes Indeterminate progress bars can be configured in 4 differents sizes | Size | Usage | | ---- | ----- | | Extra small | Height 8px. Use it in small contexts. | | Default | Height 20px. Use it by default. | Variations Progress bar This is an indeterminate progress bar. This progress bar can be used with or without label. If you foresee this pattern will be used in a process that can take long time to be completed, a label can be useful to the user. But there is not always the need to show the completion percentage. Stripped contextual progress bar Lexicon provides an alternative to the previous progress bar based on stripes that could help your users to identify better the action progrees. Multi step progress bar A multi step progress bar, also known as wizard, is a determinate progress bar. This progress bar is used in long processes dividing the main task in subtasks that will help your users completing the process. ","srcFilePath":"src/pages/docs/patterns/progress_bars.md","id":"progress_bars","url":"/docs/patterns/progress_bars.html"},"sidebar":{"title":"Sidebar","description":"Sidebar for extended information.","layout":"guide","weight":1,"content":" Description Sidebar is a vertical panel that appears from the right side of the screen on interactions like the info button. Usage Sidebar is basically an information container where to display information. This information can be of the type you want. Usually it is used to show detail information of an element without navigating deeper in the navigation hierarchy. The side bar can be configured in light background color or inverse (dark). The following example shows the information panel for an element in the document library. In this case, we want to show differnt information as the image itself, the urls, and other metadata are shown. ","srcFilePath":"src/pages/docs/patterns/sidebar.md","id":"sidebar","url":"/docs/patterns/sidebar.html"},"sidenav":{"title":"Side nav","description":"Side panel for navigation.","layout":"guide","weight":1,"content":" Description Side navigation pattern brings a panel from the leftmost or rightmost side of the screen pushing the content. Usage This pattern is created to include portal main navigation in portal. This navigation is divided is 3 main areas: Control panel, User, and the Site. Different applications are contained inside each of this sections. The side navigation is always shown and hidden interacting with the menu button. ","srcFilePath":"src/pages/docs/patterns/sidenav.md","id":"sidenav","url":"/docs/patterns/sidenav.html"},"table":{"title":"Table","description":"Dataset representation.","layout":"guide","weight":1,"content":" Description A table is a specific pattern for comparing datasets in a very direct an analytical way. Usage A table view is useful for comparing entries among them that need exhaustive comparison. Tables are very heavy in text display, if you need to display images we recommend you to take a look at lists and cards. A table entry or row don't allow you to display 2 different data types in one same column. The reason behing this are comparison and sorting problems. When a table is used together with management bar, the table entries must include the checkbox, as the selection and actions are reflected in the management bar. Row interactions Selecting a row is only possible by using the checkbox. Text elements in the row can be configured as links to navigate. A row can have none or several actions associated. When there is only one action and it can be represented by an icon, you don't need to make use of the actions menu. Otherwise, use the actions menu on the right side of the row. If the action you want to perform of is \"Edit\", place it as a link in the title to navigate to an edition screen for the element. If the link drives the user out of the admin site, please identify visually that this link will open in a new page. A cell entry could include a button as main action of a table entry. An example could be \"Execute\". Drag and drop is possible for moving selected elements into a folder. A click and drag over a non selected element implies selection. Row states Default state Selected state Hover state By default, Lexicon does not use the hover state in tables. Row attributes Table helpers Stripes Bordered Hover In the following example you can see how hover works even with a selected row. Mobile Due to the complexity of a table in mobile, Lexicon does not define this pattern for mobile viewport size. Example of use Due to the complexity of a table in mobile, Lexicon does not define this pattern for mobile viewport size. ","srcFilePath":"src/pages/docs/patterns/table.md","id":"table","url":"/docs/patterns/table.html"},"timelines":{"title":"Timelines","description":"Timelines visually represent events along the time.","layout":"guide","weight":1,"content":" Description Timelines visually represent events along the time. Usage Timelines are series of events placed in a timeline. Each event is composed by a point placed in the line a panel to describe the event to the right or left of the point. The point can be any kind of identifier. We recommend the default one, circle, but it can be the case of events related to people where you might prefer to use a user identifier. Variations Default The icons are aligned to the left side of the screen. Right timeline The icons are aligned to the right side of the screen. Center timeline The icons are aligned to the center of the screen. Even/odd timeline Being in the center the panel can appear in alternate positions starting on the left side for even configuration and starting on the right for odd configuration. Timeline Even Timeline Odd Right XS Timeline only On window resize to mobile viewport (","srcFilePath":"src/pages/docs/patterns/timelines.md","id":"timelines","url":"/docs/patterns/timelines.html"},"toolbar":{"title":"Toolbar","description":"How to build your own toolbar.","layout":"guide","weight":1,"content":" Description A toolbar is a set of actions related to a context grouped in a bar. Usage A toolbar is a generic bar that helps grouping actions in a way that they are visually organized for any context of use in Lexicon. Its height changes depending on the heigth of the elements it contains. The toolbat always maintais the vertical alignment. You only need to define the number of blocks or containers that you want to have in your toolbar and place the elements inside it. These blocks or containers are of 2 different types: Field: is used to make tight groups. Content: is used to span as much as possible in the rest of the space. In case there are severral contents the available space is equally divided. Layout For a better understading of the previous sections, here are some example layouts: Example 1: Three consecutive fields Example 2: Three consecutive contents Example 3: Field - Content - Field Example 4: Field - Field - Content - Content ","srcFilePath":"src/pages/docs/patterns/toolbar.md","id":"toolbar","url":"/docs/patterns/toolbar.html"},"typography":{"title":"Typography","description":"Typeface usage.","layout":"guide","weight":1,"content":" Description Lexicon uses Helvetica Neue as the default font face. You can use the font face you consider more appropiate for your system. Sizes Lexicon only defines 3 font sizes for the common usage and leaves H values open for free use. | Size | Usage | | ---- | ----- | | 19px | Defined for titles. | | 16px | Defined for normal text, paragraphs, etc. | | 14px | Defined for details, help text supporting components, etc. | ","srcFilePath":"src/pages/docs/patterns/typography.md","id":"typography","url":"/docs/patterns/typography.html"},"user_icons":{"title":"User icons","description":"Visual representation of a user.","layout":"guide","weight":1,"content":" Description User icons are used to visually identify users in the system. Usage Use a user icon to identify a user inside a context. User icons in Lexicon are always displayed inside a circle. Size | Size | Usage | | ---- | ----- | | Extra small | 22px. Use it in timelines and cards as identifier. Use it when you need to include many users. | | Small | 30px. Use it in timelines and cards as identifier. | | Default | 32px. The most common usage. | | Large | 45px. Use it in user centered contexts as user cards. | | Extra large | 64px. Use it in user centered contexts as user cards. | | Extra estra large | 128px. Use it in user centered contexts as user cards. | Types User icon with image User images help to personalize the interface. In case you have your user image and can make use of it, use this type of user icon. User icon with text Sometimes you won’t have the user image or won’t be allowed to use it. In those cases use this pattern. The text must be always in capital letters and a maximum of 2 letters. Use first letter from Name and Surname (NS). ","srcFilePath":"src/pages/docs/patterns/user_icons.md","id":"user_icons","url":"/docs/patterns/user_icons.html"},"Forms":{"children":{"forms":{"title":"Forms","description":"Forms usage tips.","layout":"guide","weight":1,"content":" Description Forms is one of the most used patterns in Lexicon. Forms capture information from the user and transmits it to the system either to store, to produce an action or both at same time. Forms in Lexicon are defined to be full width. Structure Forms can be created in one single column or two columns. If your form is divided in several sections that are stacked consider not changing the internal layout between sections, it can affect the experience of filling the whole form. When applying columns take into account that the reading directions is left-right, and up-down, in each column. So expect your user to read first column one and then column two. Sections Sections help users to fill a form by chunking the form is smaller pieces. A form section is identified with an accordion. There is no limitation in the number of accordions to use. Fields’ order Laying out the fields of your form we recommend you to follow an order of importance. Try to place first as many mandatory fields when possible to make the user task short. Non mandatory fields should go in a second place as they are not so important and the user could like to skip them. In case non mandatory fields are in between mandatory fields the user would expend more time scanning the form. Fields’ lengths Fields must occupy the space you expect your user needs to fill it. The only requirement for fields is to adapt their width to the grid so they behave properly on window resize. Sharp shape forms do not go against Lexicon but we prefer rectangular shape form as they look more clear. In mobile view ports field lengths should be half of the screen or full length. Mandatory fields Fields can be mandatory/required to fill in a form. The way to mark a field as mandatory is: Inline validation Forms have inline validation. All form fields that can be checked against a set of rules while filling them must show success or error state to the user. Content blocks Content block allow you let the user add contents of a same type in a form. Content blocks are usually used to contribute with more form pieces that allow the user to specify more information. Content block always bring the possibility to add or remove blocks. See the following example: Actions General actions General form actions always placed at the end of the form and they are always placed in same order: Primary, Secondary (default), Negative (Link). The button size to use is large. Interior actions Interior form actions should not be as notorious as general actions. Therefore they use default button size. ","srcFilePath":"src/pages/docs/patterns/Forms/forms.md","id":"forms","url":"/docs/patterns/Forms/forms.html"},"radio_check_toggle":{"title":"Checkbox, Radio button, Toggle","description":"Checkbox, Radio button, Toggle usage.","layout":"guide","weight":2,"content":" Checkbox A checkbox is a component that allows the user selecting something writen in its associatead text label. A list of consecutive checkboxes would allow the user to select multiple things. Usage Checkboxes should be used when more than one option can be selected. Better if they are stacked Mutually inclusive options Use it for a single binary option as unique entry Note that although we have visually defined the checkbox, we use the native checkbox as it is easier to identify by the end user using different web browsers. States Default Active Disable Radio button A radio button is a component that allows the user selecting something writen in its associatead text label. A list of consecutive radio buttons would allow the user to select just one thing. Usage As a general rule of thumb, radio buttons should be used when there’s a range of options and only one option can be chosen. Better if they are stacked. Do not use for a single binary option. Note that although we have visually defined the radio button, we use the native radio button as it is easier to identify by the end user using different web browsers. States Default Active Disable Radio vs Dropdown Menu It is a common case of doubt when to use radios or a dropdown menu instead when users need to choose one item out of a list of options. There is not a fixed rule for that but we propose this guidelines. Radio buttons: When the number of options is small When options need a long label to explain the differences of each option. Radio buttons are always listed vertically. Dropdown menus: When the number of options is large, or has the potential to become large. Options should be of the same nature (e.g. a list of branches, or a list of people). Toggle A toogle is an interface element that by its activation or deactivation provokes a inmediate action in the screen. Usage Use a toggle to present the user mutually exclusive options that have an action that is possible to perceive inmediately. Use doubt cases Use a radio button or drop down rather than an on/off switch if the two states in question are separate options. In confirmation messages use always a checkbox instead of a toggle as it is a single binary option. States Default Active Disable Variations Toggle with data attributes This type of toggles have labels around as the title label or other support label that make more explicit the switch value. The support label can be either at the top, right, bottom or left and its value should change with the toggle state change as the example shows. All the labels have the interaction that the switch have making the toggle more accessible. Toggle with icon Toggles can also have an icon inside the toggle circle that helps to identify the action. A toggles with icon can also have data attributes as the previous variation. ","srcFilePath":"src/pages/docs/patterns/Forms/radio_check_toggle.md","id":"radio_check_toggle","url":"/docs/patterns/Forms/radio_check_toggle.html"},"selector":{"title":"Selectors","description":"Selector variations and usage.","layout":"guide","weight":3,"content":" Selector Selectors are frequently used as a part of forms. This elements are used when we need to select one or more within several options. These options are displayed in the button once selected. Usage This pattern is completely different from a dropdown as a selector is a native element with a list asociated. A dropdown instead opens a panel where the panel could contain multiple different things. States Default Active Multiple selector Select button used to select more than one option from a simple list. States Default Active ","srcFilePath":"src/pages/docs/patterns/Forms/selector.md","id":"selector","url":"/docs/patterns/Forms/selector.html"},"text_input":{"title":"Text input","description":"Text input variations, validations and usage.","layout":"guide","weight":4,"content":" Text field A textfield is the most basic pattern for introducing text for a conversation between human and machine. States Default Active Disabled Read only Validations Success Warning Error Text area A text area is similar to a text field input but for several lines of text. Text areas allow users to introduce long description of products as an example. Usage Text area can be resized allowing the user to see more or less text as he please. Text area states and validation states are the same as for the text field.","srcFilePath":"src/pages/docs/patterns/Forms/text_input.md","id":"text_input","url":"/docs/patterns/Forms/text_input.html"},"text_input_group":{"title":"Text input group","description":"Text input group variations and usage.","layout":"guide","weight":5,"content":" Description A text input group is a text field with extra elements that makes the pattern more complete for a common or frequent use case. Layout The layout of an input has a bit of freedom. You are allowed to configure elements on the left or the right side of the field or both at same time. Usually the components placed around the textfield are buttons, split button and/or help labels. These help labels are placed to make more explicit things as currency, unit of measurement, digits, email addresses, etc. Types Default input group Input group with button Input group with units Sizes Input groups can be configured in 3 different sizes from small, to default, to large. The measures can be taken from input fields and buttons. ","srcFilePath":"src/pages/docs/patterns/Forms/text_input_group.md","id":"text_input_group","url":"/docs/patterns/Forms/text_input_group.html"}},"title":"Forms","description":"Forms section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Forms/index.md","id":"Forms","url":"/docs/patterns/Forms","childIds":["forms","radio_check_toggle","selector","text_input","text_input_group"]},"Templates":{"children":{"datasetTemplate":{"title":"Dataset template","description":"Dataset template description","layout":"guide","weight":1,"content":" Description Dataset template shows how a dataset is displayed using Lexicon. Structure This template counts with several patterns listed as follown that can be directly mapped with the image. Header toolbar: the actions menu must only contain direct actions over the application in question as import, export, permissions. Navigation bar: includes different entries of the application. If there is only one it must be present in the bar. Search field is optional and only acts over the selected element in the navbar. Dataset display Management bar Breadcrumb (When further than first level) Visualization: Table / List / Cards Pagination bar Plus button: Place it in case your dataset allows adding more elements Example ","srcFilePath":"src/pages/docs/patterns/Templates/datasetTemplate.md","id":"datasetTemplate","url":"/docs/patterns/Templates/datasetTemplate.html"},"formsTemplate":{"title":"Form template","description":"Forms pattern description","layout":"guide","weight":1,"content":" Description Form template helps you to understand how forms are built and composed using Lexicon. This template will allow you to understand how to create any form. Structure A form template count with several patterns that shape this pattern: Header toolbar Navigation bar (not always needed) Tab bar (Not always needed) Form Series of panels and pangels with accordions. Accordions work as functional form modules or sections. All the actions inside a form must be secondary, having only one primary action to really catch the user attention Form main buttons: always placed to the left side and in the following order: Primary, secondary, link Example ","srcFilePath":"src/pages/docs/patterns/Templates/formsTemplate.md","id":"formsTemplate","url":"/docs/patterns/Templates/formsTemplate.html"}},"title":"Templates","description":"Templates section","layout":"guide","weight":1,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/Templates/index.md","id":"Templates","url":"/docs/patterns/Templates","childIds":["datasetTemplate","formsTemplate"]}},"title":"Pattern library","description":"Patterns section","layout":"guide","icon":"lexicon-site-doc","weight":2,"content":" Interessantiss quisso pudia ce receita de bolis, mais bolis eu num gostis. Suco de cevadiss deixa as pessoas mais interessantiss. Vehicula non. Ut sed ex eros. Vivamus sit amet nibh non tellus tristique interdum. Lorem ipsum dolor sit amet var hello = function() { console.log('Hello, World!'); }; Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Curabitur nulla libero, eleifend in euismod eget, fringilla id diam. Proin quis interdum ipsum. Fusce eros metus, hendrerit ut egestas nec, sagittis id velit. ","srcFilePath":"src/pages/docs/patterns/index.md","id":"patterns","url":"/docs/patterns","childIds":["alerts","badges_labels_stickers","Breadcrumb","buttons","cards","collapsible_search","colors","dataset_display","dropdowns","Forms","grid","header_toolbar","icons","list_groups","loading_indicator","management_bar","modals","nav","nav tabs","navbar","pager","pagination","panel","popovers_tooltips","progress_bars","sidenav","sidebar","table","Templates","timelines","toolbar","typography","user_icons"]}},"childIds":["lexicon","patterns","news","search"]}},"childIds":["docs"]}}